"use client";

import styles from "./page.module.scss";
import { useEffect, useRef, useLayoutEffect } from "react";

import { gsap } from 'gsap';
import { ScrollTrigger } from 'gsap/ScrollTrigger';
import ScrollSmoother from "gsap/ScrollSmoother";
import { MotionPathPlugin } from "gsap/MotionPathPlugin";
import { DrawSVGPlugin } from "gsap/DrawSVGPlugin";

gsap.registerPlugin(ScrollTrigger, ScrollSmoother, MotionPathPlugin, DrawSVGPlugin);

const useSmoothScroll = true;
const cardIds1 = ["card1", "card2", "card3", "card4"];
const cardIds2 = ["s1card1", "s1card2", "s1card3", "s1card4"];
const cardIds3 = ["s2card1", "s2card2", "s2card3", "s2card4", "s2card5", "s2card6", "s2card7", "s2card8"];
const text = "Lorem ipsum dolor sit amet consectetur adipisicing elit.";

export default function Home() {

  /* Timeline param...
  start: "<triggerPoint> <viewportPoint>"
  end: "<triggerPoint> <viewportPoint>"
  start: "top bottom"       // Когда верх элемента касается низа окна
  start: "top center"       // Когда верх элемента касается центра окна
  start: "center center"    // Центр элемента касается центра окна
  start: "bottom top"       // Низ элемента касается верха окна
  start: "top 100px"        // Верх элемента касается точки 100px от верха
  start: "top+=50 bottom"   // Смещение 50px от верха элемента до низа окна

  toggleActions: "onEnter onLeave onEnterBack onLeaveBack"
  play	Проигрывает анимацию
  pause	Ставит на паузу
  resume	Продолжает с того места, где остановилась
  restart	Запускает анимацию с начала
  reset	Сбрасывает прогресс, возвращает к началу
  complete	Проматывает до конца
  reverse	Проигрывает в обратную сторону
  none	Ничего не делает
  */

  /* GSAP timeline...
  let All = gsap.timeline({
    scrollTrigger: {
      trigger: "name, #id, .selector",          // Element that triggers the animation
      start: "top center",        // When the top of the trigger hits the center of the viewport
      end: "bottom top",          // When the bottom of the trigger hits the top of the viewport
      scrub: true,                // Smooth scrubbing, takes animation progress from scroll position
      pin: false,                 // Set to true to pin the trigger element during animation
      markers: true,              // Show visual markers for start/end (for debugging)
      toggleActions: "play pause resume reset", // Actions on: enter, leave, enter back, leave back if scrub: false
      id: "card1-animation",      // Optional ID for debugging or reference
      anticipatePin: 0,           // Adjust pin delay (helps with layout shifts)
      fastScrollEnd: false,       // End immediately on fast scroll (if scrub is used)
      once: false,                // If true, triggers only once
      toggleClass: {              // Add/remove class on enter/leave
        targets: "#card1",
        className: "active"
      },
      pinSpacing: true,           // Adds/removes spacing when pin is used
      pinType: "transform",       // Can be "fixed" or "transform" (automatically chosen by default)
      onEnter: () => console.log("Entered"),   // Callback on entering trigger
      onLeave: () => console.log("Left"),      // Callback on leaving trigger
      onEnterBack: () => console.log("Back in"), // Callback when scrolling back in
      onLeaveBack: () => console.log("Back out"),// Callback when scrolling back out
      onUpdate: self => console.log("Progress:", self.progress), // Fires on scroll updates
    }
  });*/

  /* Animation param...
  x - перемещение по оси X
  y - перемещение по оси Y
  z - перемещение по оси Z (3D)
  xPercent - перемещение в процентах по оси X
  yPercent - перемещение в процентах по оси Y
  scale - масштаб по всем осям
  scaleX - масштаб по оси X
  scaleY - масштаб по оси Y
  scaleZ - масштаб по оси Z
  rotation - вращение по оси Z (2D)
  rotationX - вращение по оси X (3D)
  rotationY - вращение по оси Y (3D)
  skewX - искажение по оси X
  skewY - искажение по оси Y
  opacity - прозрачность (0 - 1)
  autoAlpha - как opacity + visibility (удобно для появления/скрытия)
  backgroundColor - изменение фона
  color - изменение цвета текста
  borderColor - изменение цвета рамки
  fill - изменение цвета заливки (например, для SVG)
  stroke - изменение цвета обводки (например, для SVG)
  filter - CSS фильтры (например, blur(5px))
  brightness - изменение яркости
  contrast - изменение контраста
  grayscale - преобразование в оттенки серого
  hueRotate - вращение оттенков
  saturate - насыщенность
  sepia - сепия
  duration - длительность анимации (в секундах) if scrub=false
  delay - задержка перед началом анимации
  repeat - количество повторений анимации
  repeatDelay - задержка между повторениями анимации
  yoyo - включает обратную анимацию после завершения (при true анимация будет происходить в обратном порядке)
  ease - тип интерполяции (например, "power1.out", "bounce", "elastic")
  transformOrigin - точка трансформации (например, "50% 50%" или "top left")
  perspective - добавление перспективы для 3D анимаций
  stagger - для последовательных анимаций с задержкой
  start - начало триггера для ScrollTrigger
  end - конец триггера для ScrollTrigger
  scrub - синхронизация анимации со скроллом
  pin - фиксация элемента на экране во время скролла
  markers - отображение маркеров начала и конца анимации
  toggleActions - действия при старте, паузе, продолжении и сбросе анимации
  onStart - функция, которая вызывается при старте анимации
  onUpdate - функция, которая вызывается при обновлении анимации
  onComplete - функция, которая вызывается при завершении анимации
  */

  /*Smooth scroll*/
  if (useSmoothScroll) {
    useLayoutEffect(() => {
      gsap.registerPlugin(ScrollTrigger, ScrollSmoother);

      const smoother = ScrollSmoother.create({
        wrapper: '#smooth-wrapper',
        content: '#smooth-content',
        smooth: 1.5,
        effects: true,
      });

      return () => {
        smoother.kill();
      };
    }, []);
  }

  /*With "scrub"*/
  useEffect(() => {
    const cards = ["#card1", "#card2", "#card3", "#card4"] as const;
    const animations: Record<typeof cards[number], gsap.TweenVars> = {
      "#card1": { x: -100, opacity: 0 },
      "#card2": { x: 100, opacity: 0 },
      "#card3": { xPercent: -50, rotation: 90, opacity: 0, duration: 1 },
      "#card4": { rotationX: 200, opacity: 0, delay: 0.2 },
    };

    cards.forEach((id) => {
      const tl = gsap.timeline({
        scrollTrigger: {
          trigger: id,
          start: "top 30%",
          end: "bottom bottom",
          scrub: 1,
          pin: true,
          markers: false,
        }
      })

      if (id === "#card3" || id === "#card4") {
        gsap.set(id, { transformOrigin: "center center" });
      }

      tl.to(id, {
        ...animations[id],
      });
    });
  }, []);

  /*Without "scrub" */
  useEffect(() => {
    const cards = ["#s1card1", "#s1card2", "#s1card3", "#s1card4"] as const;

    cards.forEach((id) => {
      const tl = gsap.timeline({
        scrollTrigger: {
          trigger: id,
          start: "top 45%",
          end: "bottom 30%",
          scrub: false,
          markers: false,
          toggleActions: "play none reverse none", // if scrub = false
        },
      });

      if (id === "#s1card1") {
        tl.from(id, {
          xPercent: -100,
          opacity: 0,
          duration: 0.8,
          ease: "power2.out",
        });
      }

      if (id === "#s1card2") {
        tl.from(id, {
          xPercent: 100,
          opacity: 0,
          duration: 0.8,
          ease: "power3.out",
        });
      }

      if (id === "#s1card3") {
        tl.from(id, {
          width: "16px",
          paddingLeft: "0px",
          paddingRight: "0px",
          opacity: 0,
          overflow: "hidden",
        });
      }

      if (id === "#s1card4") {
        tl.from(id, {
          borderColor: "rgba(255, 255, 255, 0)",
          boxShadow: "none",
          duration: 0.8,
          ease: "power2.out",
        });
      }
    });
  }, []);

  /*Horizontal cards scroll*/
  useLayoutEffect(() => {
    const cards = ["#s2card1", "#s2card2", "#s2card3", "#s2card4", "#s2card5", "#s2card6", "#s2card7", "#s2card8"] as const;
    const cardsPin = document.getElementById("cardsPin");

    gsap.to(cards, {
      xPercent: -100 * (cards.length - 3.5),
      ease: "none",
      scrollTrigger: {
        trigger: cardsPin,
        pin: true,
        scrub: 0.3,
        end: () => `+=${window.innerWidth * (cards.length)}`,
      },
    });

    cards.forEach((id) => {
      const tl = gsap.timeline({
        scrollTrigger: {
          trigger: cardsPin,
          start: "top-=20% 20%",
          end: "bottom+=1620% 80%",
          scrub: false,
          markers: false,
          toggleActions: "play reverse play reverse",
        },
      });

      tl.fromTo(id,
        { opacity: 0, scale: 0.6, duration: 0.4, stagger: 0.2, ease: "power3.out" },
        { opacity: 1, scale: 1, duration: 0.8, stagger: 0.2, ease: "power2.out" });
    });
  }, []);

  /*Image gallery horizontal scroll*/
  useLayoutEffect(() => {
    const ctx = gsap.context(() => {
      const chars = gsap.utils.toArray(".char");
      const images = gsap.utils.toArray(".imagePin img");
      const section = document.getElementById("horizSectionPin");

      gsap.to(images, {
        xPercent: -100 * (images.length - 1),
        ease: "none",
        scrollTrigger: {
          trigger: section,
          pin: true,
          scrub: 1,
          end: () => `+=${window.innerWidth * images.length}`,
        },
      });

      gsap.fromTo(
        chars,
        {
          y: 100,
          rotation: 90,
          opacity: 0,
        },
        {
          y: 0,
          rotation: 0,
          opacity: 1,
          duration: 0.8,
          ease: "elastic.out(1, 0.3)",
          stagger: 0.03,
          scrollTrigger: {
            trigger: section,
            start: "top-=40% 30%",
            markers: false,
            toggleActions: "play none play reverse",
          },
        }
      );

      gsap.to(chars, {
        opacity: 0,
        rotation: () => gsap.utils.random(-2000, 2000),
        x: () => gsap.utils.random(-200, 200),
        y: () => gsap.utils.random(-200, 200),
        duration: 0.5,
        ease: "power4.out",
        stagger: 0.015,
        scrollTrigger: {
          trigger: section,
          start: () => `top+=${window.innerWidth * (images.length - 1)}`,
          end: () => `top+=${window.innerWidth * images.length}`,
          scrub: true,
        },
      });
    });

    return () => ctx.revert();
  }, []);

  /*Background SVG animation*/
  const maskRef = useRef<SVGPathElement | null>(null);

  useEffect(() => {
    if (!maskRef.current) return;

    const section = document.getElementById("svgPin");
    const path = maskRef.current;
    const pathLength = path.getTotalLength();

    gsap.set(path, {
      strokeDasharray: pathLength,
      strokeDashoffset: pathLength,
    });

    const tl = gsap.timeline({
      scrollTrigger: {
        trigger: section,
        start: "top 30%",
        end: "bottom bottom",
        scrub: false,
        pin: true,
        markers: false,
        toggleActions: "play none reverse none",
      },
    });

    tl.to(path, {
      strokeDashoffset: 0,
      duration: 14,
      ease: "power3.out",
    });

    return () => {
      tl.scrollTrigger?.kill();
      tl.kill();
    };
  }, []);

  /*Path SVG animation*/
  const bugRef = useRef<SVGCircleElement | null>(null);
  const pathRef = useRef<SVGPathElement | null>(null);

  useEffect(() => {
    if (!bugRef.current || !pathRef.current) return;

    const path = pathRef.current;
    const bug = bugRef.current;
    const pathLength = path.getTotalLength();

    let rotateTo = gsap.quickTo(bugRef.current, "rotation"),
      prevDirection = 0;

    gsap.set(bugRef.current, { transformOrigin: "50% 50%" });

    gsap.to(bug, {
      scrollTrigger: {
        trigger: path,
        start: 'top center',
        end: `+=${pathLength}`,
        scrub: 0.5,
        markers: false,
        onUpdate: self => {
          if (prevDirection !== self.direction) {
            rotateTo(self.direction === 1 ? 0 : -180);
            prevDirection = self.direction;
          }
        }
      },
      ease: 'none',
      immediateRender: true,
      motionPath: {
        path: path,
        align: path,
        alignOrigin: [0.5, 0.5],
        autoRotate: 90,
      },
    });
  }, []);

  return (
    <div id="smooth-wrapper">
      <div id="smooth-content">
        <section className={styles.mainSection}>
          <div className={styles.section}>
            <h1>GSAP Animation with "scrub"</h1>

            <div className={styles.cardsWrapper1}>
              {cardIds1.map((id) => (
                <div key={id} id={id} className={styles.animCard}>
                  <h2>Animate Me</h2>
                  <p>
                    Lorem ipsum dolor sit amet consectetur adipisicing elit.
                    Nisi, impedit! Excepturi earum sapiente rerum eveniet
                    sequi voluptatem facilis commodi!
                  </p>
                </div>
              ))}
            </div>
          </div>

          <div className={styles.section}>
            <h1>GSAP Animation without "scrub"</h1>

            <div className={styles.cardsWrapper1}>
              {cardIds2.map((id) => (
                <div key={id} id={id} className={styles.animCard}>
                  <h2>Animate Me</h2>
                  <p>
                    Lorem ipsum dolor sit amet consectetur adipisicing elit.
                    Nisi, impedit! Excepturi earum sapiente rerum eveniet
                    sequi voluptatem facilis commodi!
                  </p>
                </div>
              ))}
            </div>
          </div>

          <div id="cardsPin" className={styles.section}>
            <h1>Horizontal slide</h1>
            <div className={styles.cardsWrapper2}>
              {cardIds3.map((id) => (
                <div key={id} id={id} className={styles.animCard}>
                  <h2>Animate Me</h2>
                  <p>
                    Lorem ipsum dolor sit amet consectetur adipisicing elit.
                    Nisi, impedit! Excepturi earum sapiente rerum eveniet
                    sequi voluptatem facilis commodi!
                  </p>
                </div>
              ))}
            </div>
          </div>

          <div id="horizSectionPin" className={styles.horizSection}>
            <h2 id="textAppear" aria-label={text}>
              {text.split("").map((char, i) => (
                <span key={i} className="char">{char === " " ? "\u00A0" : char}</span>
              ))}
            </h2>

            <div id="imageWrapper" className={`${styles.horizWrapper} imagePin`}>
              <img src="https://images.pexels.com/photos/31388429/pexels-photo-31388429.jpeg" alt="" />
              <img src="https://images.pexels.com/photos/32026165/pexels-photo-32026165.jpeg" alt="" />
              <img src="https://images.pexels.com/photos/7054530/pexels-photo-7054530.jpeg" alt="" />
              <img src="https://images.pexels.com/photos/19291136/pexels-photo-19291136.jpeg" alt="" />
            </div>
          </div>

          <div id="svgPin" className={styles.SVGsection}>
            <svg
              width="1512"
              height="418"
              viewBox="0 0 1512 418"
              preserveAspectRatio="xMaxYMin slice"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <defs>
                <mask id="path-mask" maskUnits="userSpaceOnUse">
                  <path
                    ref={maskRef}
                    d="M538.854 8.24339C538.854 3.69069 542.545 0 547.098 0H599.649C604.202 0 607.893 3.69069 607.893 8.24339V59.7645C607.893 64.3172 604.202 68.0079 599.649 68.0079H547.098C542.545 68.0079 538.854 64.3172 538.854 59.7645V8.24339ZM-32 10.3039C-32 5.75124 -28.3093 2.06055 -23.7566 2.06055H28.795C33.3477 2.06055 37.0384 5.75124 37.0384 10.3039V62.8555C37.0384 67.4082 33.3477 71.0989 28.795 71.0989H-23.7566C-28.3093 71.0989 -32 67.4082 -32 62.8555V10.3039ZM1526 10.3039C1526 5.75124 1522.31 2.06055 1517.76 2.06055H1465.21C1460.65 2.06055 1456.96 5.75124 1456.96 10.3039V62.8555C1456.96 67.4082 1460.65 71.0989 1465.21 71.0989H1517.76C1522.31 71.0989 1526 67.4082 1526 62.8555V10.3039ZM175.115 139.107C175.115 134.554 171.424 130.863 166.871 130.863H114.321C109.768 130.863 106.077 127.173 106.077 122.62V78.3117C106.077 73.759 102.387 70.0684 97.834 70.0684H45.2824C40.7298 70.0684 37.0391 73.759 37.0391 78.3117V129.833C37.0391 134.386 40.7298 138.076 45.2824 138.076H97.8328C102.385 138.076 106.076 141.767 106.076 146.32V191.658C106.076 196.211 109.767 199.902 114.32 199.902H166.871C171.424 199.902 175.115 196.211 175.115 191.658V139.107ZM1387.92 121.591C1387.92 126.143 1384.23 129.834 1379.68 129.834H1336.4C1331.85 129.834 1328.16 133.525 1328.16 138.077V190.629C1328.16 195.182 1331.85 198.872 1336.4 198.872H1388.95C1393.51 198.872 1397.2 195.182 1397.2 190.629V139.107C1397.2 134.554 1400.89 130.863 1405.44 130.863H1448.72C1453.27 130.863 1456.96 127.173 1456.96 122.62V71.0989C1456.96 66.5462 1453.27 62.8555 1448.72 62.8555H1396.17C1391.61 62.8555 1387.92 66.5462 1387.92 71.0989V121.591ZM313.191 10.3039C313.191 5.75124 309.5 2.06055 304.947 2.06055H252.396C247.843 2.06055 244.152 5.75124 244.152 10.3039V62.8555C244.152 67.4082 247.843 71.0989 252.396 71.0989H299.796C304.348 71.0989 308.039 74.7896 308.039 79.3423V129.833C308.039 134.386 304.348 138.076 299.796 138.076L252.396 138.076C247.843 138.076 244.152 141.767 244.152 146.32V190.628C244.152 195.18 240.462 198.871 235.909 198.871H183.359C178.806 198.871 175.115 202.562 175.115 207.114V258.636C175.115 263.188 178.806 266.879 183.359 266.879H235.91C240.463 266.879 244.154 263.188 244.154 258.636V215.358C244.154 210.805 247.844 207.115 252.397 207.115H304.947C309.5 207.115 313.191 203.424 313.191 198.871V146.32C313.191 141.767 316.881 138.076 321.434 138.076L368.834 138.076C373.387 138.076 377.077 134.386 377.077 129.833V90.6771C377.077 86.1244 380.768 82.4337 385.321 82.4337H435.811C440.364 82.4337 444.055 78.743 444.055 74.1903V22.6692C444.055 18.1165 440.364 14.4258 435.811 14.4258H383.26C378.707 14.4258 375.016 18.1165 375.016 22.6692V61.825C375.016 66.3777 371.326 70.0684 366.773 70.0684H321.434C316.881 70.0684 313.191 66.3777 313.191 61.825V10.3039ZM1260.15 189.598C1260.15 194.151 1263.84 197.842 1268.39 197.842H1319.91C1324.47 197.842 1328.16 201.532 1328.16 206.085V252.454C1328.16 257.007 1331.85 260.697 1336.4 260.697H1386.89C1391.45 260.697 1395.14 264.388 1395.14 268.941V321.492C1395.14 326.045 1391.45 329.736 1386.89 329.736H1334.34C1329.79 329.736 1326.1 326.045 1326.1 321.492V274.093C1326.1 269.54 1322.41 265.85 1317.85 265.85H1267.36C1262.81 265.85 1259.12 262.159 1259.12 257.606V220.51C1259.12 215.958 1255.43 212.267 1250.88 212.267H1199.36C1194.8 212.267 1191.11 208.576 1191.11 204.023V151.472C1191.11 146.919 1194.8 143.229 1199.36 143.229H1251.91C1256.46 143.229 1260.15 146.919 1260.15 151.472V189.598ZM1042.73 44.3078C1042.73 39.7551 1046.42 36.0645 1050.97 36.0645H1103.53C1108.08 36.0645 1111.77 39.7551 1111.77 44.3078V95.829C1111.77 100.382 1108.08 104.072 1103.53 104.072H1050.97C1046.42 104.072 1042.73 100.382 1042.73 95.829V44.3078ZM-32 142.198C-32 137.646 -28.3093 133.955 -23.7566 133.955H28.795C33.3477 133.955 37.0384 137.646 37.0384 142.198V194.75C37.0384 199.303 33.3477 202.993 28.795 202.993H-23.7566C-28.3093 202.993 -32 199.303 -32 194.75V142.198ZM1456.96 146.32C1456.96 141.767 1460.65 138.076 1465.21 138.076H1517.76C1522.31 138.076 1526 141.767 1526 146.32V198.871C1526 203.424 1522.31 207.115 1517.76 207.115H1465.21C1460.65 207.115 1456.96 203.424 1456.96 198.871V146.32ZM106.076 275.122C106.076 270.57 109.767 266.879 114.32 266.879H166.871C171.424 266.879 175.115 270.57 175.115 275.122V327.674C175.115 332.227 171.424 335.917 166.871 335.917H114.32C109.767 335.917 106.076 332.227 106.076 327.674V275.122ZM1266.33 332.827C1266.33 328.275 1262.64 324.584 1258.09 324.584H1205.54C1200.98 324.584 1197.29 328.275 1197.29 332.827V385.379C1197.29 389.932 1200.98 393.622 1205.54 393.622H1258.09C1262.64 393.622 1266.33 389.932 1266.33 385.379V332.827ZM263.731 356.527C263.731 351.974 267.422 348.283 271.975 348.283H324.526C329.079 348.283 332.77 351.974 332.77 356.527V409.078C332.77 413.631 329.079 417.322 324.526 417.322H271.975C267.422 417.322 263.731 413.631 263.731 409.078V356.527Z"
                    stroke="white"
                    fill="none"
                    strokeWidth="2"
                  />
                </mask>

                <linearGradient id="paint0_linear" x1="747" y1="0" x2="747" y2="417.321" gradientUnits="userSpaceOnUse">
                  <stop stopOpacity="0" />
                  <stop offset="0.290677" />
                  <stop offset="0.784847" stopOpacity="0" />
                </linearGradient>
              </defs>

              <g opacity="0.2">
                <rect
                  x="0"
                  y="0"
                  width="1512"
                  height="418"
                  fill="url(#paint0_linear)"
                  mask="url(#path-mask)"
                />
              </g>
            </svg>

          </div>

          <div className={styles.section}>
            <h1>Motion Path</h1>

            <div id="svgSection" className={styles.svgImage}>
              <svg width="1100" height="2806" viewBox="0 0 1100 2806" fill="none" xmlns="http://www.w3.org/2000/svg" >
                <g clipPath="url(#clip0_2001_351)">
                  <mask id="mask0_2001_351" style={{ maskType: 'luminance' }} maskUnits="userSpaceOnUse"
                    x="0" y="93" width="1100" height="2645" >
                    <path d="M0 93L0 2738H1099.7L1099.7 93H0Z" fill="white" />
                  </mask>
                  <g mask="url(#mask0_2001_351)">
                    <path id="motionPath" 
                      ref={pathRef}
                      d="M902.245 1751.04C902.247 1804.42 895.07 1855.29 880.42 1901.73C841.001 2026.67 753.659 2108 673.416 2171.07C661.252 2180.64 648.966 2190.07 636.654 2199.52C565.309 2254.3 491.534 2310.94 438.378 2396.72C350.156 2539.08 332.619 2754.2 395.732 2919.87L392.35 2922.3C328.53 2754.78 346.268 2537.26 435.47 2393.31C489.073 2306.82 563.151 2249.94 634.792 2194.94C647.091 2185.5 659.367 2176.07 671.522 2166.52C751.216 2103.87 837.944 2023.18 876.918 1899.64C922.698 1754.52 894.455 1565.01 801.348 1392.74C760.031 1316.29 710.375 1247.27 662.352 1180.52C618.843 1120.05 573.854 1057.52 535.073 989.51C488.525 907.884 386.032 694.965 439.544 481.309C458.166 406.95 493.779 342.974 528.219 281.106L532.645 273.147C569.97 206.008 604.712 139.399 619.673 62.7742C636.611 -23.9924 621.83 -111.825 582.003 -160.953L584.554 -164.859C625.438 -114.424 640.678 -24.5513 623.361 64.1372C608.22 141.684 573.246 208.76 535.681 276.333L531.253 284.292C496.998 345.828 461.575 409.465 443.154 483.02C390.258 694.206 491.917 905.316 538.079 986.271C576.726 1054.04 621.637 1116.47 665.068 1176.83C713.184 1243.71 762.937 1312.86 804.413 1389.61C868.646 1508.46 902.24 1635.58 902.245 1751.04Z"
                      fill="white"
                    />
                  </g>
                  <g ref={bugRef}>
                    <path d="M584.541 114.941C584.308 116.833 584.068 118.724 583.845 120.618C583.739 121.522 584.297 122.403 583.948 123.319C583.57 123.034 583.989 122.531 583.604 122.18C581.93 123.345 581.069 124.964 580.542 126.924C579.735 129.924 579.87 132.898 580.347 135.898C580.434 136.441 580.649 136.969 580.844 137.489C580.943 137.754 581.138 137.997 580.82 138.225C580.522 138.438 580.177 138.412 579.931 138.186C579.494 137.785 579.002 137.396 578.808 136.811C577.214 131.99 576.925 127.237 579.62 122.661C580.392 121.35 581.544 120.397 582.837 119.686C583.64 119.245 583.927 118.73 583.868 117.884C583.715 115.702 584.461 113.646 584.784 111.531C584.805 111.395 584.954 111.278 585.043 111.152C584.875 112.414 584.707 113.678 584.541 114.941Z" fill="#2C251E" />
                    <path d="M610.854 151.993C610.779 154.058 610.72 156.087 609.892 158.078C608.679 160.996 606.792 163.255 604.14 164.904C602.184 166.12 600.047 166.861 597.757 167.124C596.771 167.238 596.605 167.701 596.52 168.705C596.162 172.902 594.933 176.828 592.222 180.168C590.213 182.643 587.996 184.828 584.84 185.83C581.288 186.957 578.859 185.634 577.859 181.998C577.506 180.715 577.217 179.44 577.462 178.108C577.601 177.349 576.988 176.968 576.68 176.433C576.129 175.478 576.366 174.487 577.273 173.936C578.338 173.288 579.33 173.432 579.921 174.277C580.506 175.115 580.107 175.861 579.619 176.465C579.05 177.171 579.074 177.869 579.213 178.66C579.433 179.927 579.768 181.155 580.33 182.314C581.008 183.712 581.773 184.122 583.318 183.844C585.83 183.393 587.687 181.854 589.447 180.134C592.701 176.957 594.291 173.015 594.93 168.596C595.06 167.699 594.907 167.282 593.907 167.213C588.994 166.872 584.93 164.647 581.356 161.402C580.708 160.813 580.403 160.992 580.052 161.717C578.689 164.539 576.938 167.109 574.814 169.412C572.817 171.578 570.503 173.352 567.767 174.451C563.846 176.026 560.458 174.213 559.556 170.324C559.072 168.235 558.808 166.169 559.205 164.052C559.314 163.47 559.168 162.977 558.954 162.44C558.465 161.22 559.059 159.936 560.192 159.621C561.065 159.377 561.65 159.744 561.754 160.605C561.839 161.305 561.855 162.128 561.323 162.658C560.685 163.295 560.698 163.977 560.824 164.741C561.122 166.551 561.347 168.369 562.029 170.101C562.75 171.931 563.994 172.689 565.954 172.391C567.666 172.131 569.097 171.248 570.493 170.329C574.219 167.874 576.842 164.44 579.005 160.608C579.371 159.961 579.413 159.439 578.932 158.757C574.718 152.768 575.264 144.865 580.885 139.814C582.478 138.383 584.261 137.452 586.253 136.817C586.543 136.724 586.92 136.774 587.002 136.351C587.668 136.344 587.615 137.05 587.984 137.338C589.196 139.822 590.931 141.907 592.917 143.801C593.001 143.952 593.053 144.115 593.082 144.284C593.416 145.097 593.248 145.485 592.27 145.612C591.458 145.717 590.738 146.213 590.334 147.014C590.116 148.196 589.866 149.361 591.158 150.174C592.462 150.994 593.219 150.904 594.21 149.693C594.41 149.449 594.591 149.19 594.814 148.966C595.264 148.676 595.175 148.294 594.993 147.894C594.961 147.714 594.975 147.537 595.032 147.363C595.264 146.85 595.706 146.828 596.176 146.871C596.773 146.932 597.231 147.264 597.672 147.632C597.965 147.959 598.346 148.123 598.765 148.216C601.379 149.648 604.245 150.349 607.094 151.098C607.686 151.254 608.275 151.26 608.871 151.156C609.197 151.125 609.489 151.239 609.775 151.373C610.114 151.616 610.605 151.595 610.854 151.993Z" fill="#2C251E" />
                    <path d="M642.547 107.272C642.75 108.68 642.982 110.083 643.152 111.495C643.62 115.399 643.388 119.276 642.604 123.12C642.142 125.383 641.568 127.615 640.618 129.733C640.506 129.79 640.405 129.777 640.319 129.682C640.122 129.334 640.334 128.976 640.28 128.515C639.777 128.686 639.251 128.882 638.999 128.137C638.795 127.531 638.255 127.346 637.643 127.362C637.361 127.369 637.08 127.35 636.819 127.233C636.493 127.086 636.084 126.945 636.134 126.509C636.193 126.011 636.652 126.078 636.994 126.099C637.671 126.141 638.339 125.882 639.024 126.045C639.019 125.788 638.754 125.702 638.648 125.508C638.44 125.129 638.077 124.708 638.526 124.341C638.901 124.034 639.269 124.344 639.559 124.646C639.922 125.026 640.44 124.983 640.887 125.134C641.353 125.291 641.708 125.511 641.292 126.089C641.549 125.124 641.257 124.596 640.343 124.428C639.563 124.284 638.776 124.255 638.072 123.769C637.668 123.492 637.083 123.633 636.713 123.918C636.359 124.19 636.715 124.584 636.852 124.891C637.191 125.653 637.154 126.156 636.139 126.044C635.677 125.993 635.807 126.27 635.748 126.541C635.627 127.09 634.985 127.502 634.716 127.123C634.133 126.302 633.678 126.782 633.12 126.978C632.719 127.118 632.237 127.034 631.994 126.742C631.333 125.945 630.463 125.862 629.546 125.838C629.25 125.729 628.971 125.594 628.75 125.362C628.616 125.129 628.479 124.895 628.778 124.68C629.484 124.416 630.178 124.654 630.875 124.727C631.683 124.718 632.322 125.426 633.253 125.136C633.943 124.921 634.27 124.206 635.058 124.133C635.366 124.104 635.136 123.529 634.903 123.232C634.615 122.865 634.457 122.441 634.752 122.025C635.133 121.487 635.596 121.82 635.853 121.907C635.205 121.641 635.263 121.731 634.38 122.292C633.699 122.726 632.877 122.999 632.014 122.957C631.904 122.908 631.82 122.833 631.762 122.726C631.722 122.545 631.76 122.382 631.88 122.239C633.374 121.61 634.549 120.583 635.558 119.333C635.852 118.967 636.152 118.59 636.579 118.355C637.011 118.178 637.004 117.784 637.041 117.411C637.075 117.09 637.087 116.747 637.249 116.479C638.073 115.108 637.89 113.635 637.732 112.163C637.791 111.775 637.853 111.386 637.562 111.049C637.095 109.742 636.141 108.716 635.514 107.502C635.474 107.226 635.325 107.011 635.136 106.817C634.448 106.167 633.647 105.803 632.685 105.835C631.321 105.402 629.84 105.622 628.498 105.073C628.201 104.702 628.457 104.513 628.741 104.332C629.387 104.142 630.032 104.203 630.782 104.417C630.256 104.157 629.769 104.231 629.352 104.014C629.257 103.946 629.184 103.86 629.137 103.753C629.078 103.432 629.227 103.209 629.475 103.035C630.155 102.714 629.482 102.406 629.462 102.09C629.599 101.125 630.272 101.018 631.001 101.251C631.505 101.412 632.036 101.624 632.421 102.045C633.135 102.84 633.957 103.374 635.092 103.366C635.956 103.36 636.758 103.629 637.273 104.4C637.775 105.15 638.623 105.105 639.326 105.189C640.464 105.325 641.305 105.937 642.188 106.531C642.33 106.769 642.407 107.036 642.547 107.272Z" fill="#920000" />
                    <path d="M603.549 87.1092C605.193 85.9867 607.097 85.5254 608.973 85.0171C609.389 84.9048 609.798 84.7835 610.203 84.6384C611.004 84.1617 611.842 83.9561 612.754 84.2814C613.93 84.4565 615.108 84.4696 616.294 84.3464C616.699 84.3043 617.306 84.118 617.415 84.6818C617.523 85.2343 616.856 85.2232 616.52 85.3913C617.285 85.1882 618.158 85.2403 618.815 84.6137C619.037 84.4015 619.249 84.5925 619.35 84.8577C619.421 88.8129 619.378 92.7623 618.901 96.6916C618.712 97.7884 618.64 98.9055 618.415 99.9975C618.36 100.264 618.272 100.608 617.95 100.612C617.572 100.616 617.591 100.235 617.574 99.977C617.544 99.499 617.428 99.0282 617.402 98.5589C617.286 96.5734 615.67 95.6987 614.396 94.689C613.4 93.9 612.023 95.0309 612.076 96.4526C612.121 97.6524 611.891 97.8031 610.831 97.2719C610.548 96.4859 610.831 95.716 610.894 94.9416C610.984 94.4894 611.097 94.0342 610.806 93.6061C610.28 92.5958 609.503 91.7778 608.753 90.9401C608.556 90.6795 608.304 90.4793 608.041 90.2889C606.696 89.6673 605.252 89.4754 603.801 89.4018C603.29 89.3757 602.954 89.939 602.513 90.1994C601.941 90.5384 601.421 90.6372 600.901 90.1098C600.173 89.3707 600.23 88.886 601.199 88.4796C602.048 88.1231 602.912 87.8189 603.549 87.1092Z" fill="#B20000" />
                    <path d="M587.817 137.428C587.256 137.287 587.403 136.612 587.003 136.35C586.341 134.674 585.69 132.992 585.003 131.326C584.86 130.978 584.818 130.648 584.861 130.291C584.565 128.884 584.514 127.435 584.056 126.053C583.9 125.584 583.663 124.955 584.481 124.663C584.832 124.537 584.545 124.273 584.408 124.107C583.804 123.374 584.073 122.586 584.315 121.839C584.462 121.384 584.985 121.143 585.133 121.725C585.339 122.527 586.222 122.948 586.095 123.892C586.554 123.65 586.9 123.34 587.347 123.341C587.758 123.341 587.727 123.179 587.654 122.863C587.572 122.514 587.777 122.184 588.103 122.112C589.163 121.877 589.161 121.088 589.089 120.289C589.052 119.875 589.258 119.607 589.459 119.318C589.708 118.959 589.992 118.628 590.055 118.167C590.105 117.81 589.937 117.247 590.56 117.285C591.134 117.322 591.186 117.799 591.14 118.264C591.125 118.299 591.093 118.334 591.081 118.38C591.091 118.376 591.12 118.353 591.176 118.304C592.589 117.967 592.491 116.434 593.302 115.623C593.484 115.442 593.501 115.019 593.78 114.975C595.026 114.776 594.57 114.216 594.19 113.528C593.75 112.732 594.227 112.506 594.952 111.994C595.847 111.361 597.173 112.129 597.759 110.931C599.125 109.382 599.456 107.759 598.11 106.017C597.972 105.779 597.817 105.551 597.644 105.336C596.694 104.094 598.058 104.099 598.607 103.683C597.235 102.342 597.235 102.219 598.563 101.839C598.675 101.82 598.787 101.818 598.9 101.825C599.607 101.926 599.829 102.783 600.592 102.858C601.354 102.934 601.723 102.647 601.51 101.972C601.421 101.691 601.017 101.434 601.331 101.128C601.651 100.817 602.106 100.901 602.469 101.057C603.434 101.472 604.413 101.439 605.41 101.249C605.586 101.255 605.748 101.304 605.894 101.405C606.436 102.174 606.179 102.685 605.301 102.654C604.281 102.618 603.91 103.068 603.684 103.978C603.395 105.149 602.216 105.334 601.184 105.891C601.598 106.053 601.962 105.971 602.246 106.135C602.776 106.44 602.847 107.249 602.313 107.342C601.409 107.498 601.31 108.395 600.685 108.798C600.189 109.118 600.646 109.479 600.955 109.727C601.815 110.421 601.874 110.582 600.946 111.122C600.049 111.645 600.273 112.602 599.838 113.281C598.549 114.471 597.487 115.853 596.532 117.31C596.114 117.948 595.503 118.6 596.048 119.498C596.17 119.698 596.005 120.144 595.832 120.085C594.677 119.696 594.182 121.047 593.195 121.031C593.115 121.03 593.036 121.016 592.91 120.98C593.415 121.32 593.846 121.09 594.285 120.944C594.651 120.823 595.026 120.565 595.378 120.979C595.467 121.437 595.137 121.613 594.824 121.783C592.915 122.82 591.791 124.491 591.019 126.454C590.838 126.913 590.781 127.488 590.131 127.584C589.701 127.31 590.13 126.712 589.431 126.254C590.065 127.054 589.77 127.557 589.375 127.992C588.756 128.673 588.703 129.673 587.773 130.259C587.256 130.584 587.467 131.744 587.349 132.527C587.182 133.63 587.013 134.694 587.903 135.664C588.347 136.15 588.141 136.851 587.817 137.428Z" fill="#AC0004" />
                    <path d="M619.144 84.6141C618.388 85.9416 616.978 85.4306 615.868 85.7602C615.793 85.7827 615.586 85.5975 615.551 85.476C615.471 85.1994 615.7 85.1686 615.904 85.1427C616.359 85.0839 616.838 85.1028 617.366 84.7135C615.787 84.1029 614.266 85.0547 612.84 84.483C612.905 83.8966 613.425 84.3716 613.642 84.1397C614.95 84.3733 616.26 84.0787 617.573 84.1718C619.654 84.3194 621.645 84.8565 623.631 85.4374C624.109 85.7295 624.628 85.8374 625.185 85.7766C626.149 85.6399 626.585 86.5335 627.308 86.8655C627.688 87.2123 628.094 87.5082 628.629 87.5596C628.842 87.7275 629.061 87.8871 629.251 88.0822C629.765 89.0395 629.65 89.2958 628.648 89.2714C627.755 89.2501 626.847 89.3549 625.871 88.997C626.639 89.595 626.873 90.1438 625.89 90.6623C626.328 90.4158 626.644 90.0353 627.169 90.0864C627.277 90.1217 627.364 90.1855 627.432 90.277C627.405 90.6012 627.306 90.9282 627.837 90.9761C628.171 91.0064 628.63 91.0923 628.666 91.5064C628.702 91.9265 628.379 92.2112 627.969 92.3475C627.856 92.3469 627.75 92.318 627.65 92.2656C626.87 91.8113 625.982 91.8875 625.137 91.7755C624.428 91.6814 624.281 92.3267 623.98 92.7555C622.817 94.0927 622.645 95.4671 623.821 96.8936C623.991 97.4864 624.387 97.8142 624.995 97.8933C625.157 97.9406 625.308 98.0117 625.447 98.1074C625.957 98.5428 626.864 98.9087 625.549 99.5344C625.112 99.7419 625.522 100.622 624.703 100.789C625.29 100.97 625.779 101.037 626.149 101.358C626.494 101.659 626.838 102.31 626.444 102.441C625.582 102.727 626.118 103.233 626.025 103.643C625.892 104.229 625.49 104.932 625.468 105.326C625.405 106.474 623.979 106.35 623.969 107.335C623.295 108.344 622.475 109.258 621.998 110.397C621.891 110.65 621.679 110.85 621.356 110.833C620.906 110.367 621.049 109.813 621.33 109.404C621.808 108.71 621.85 107.844 622.417 107.168C622.899 106.596 622.318 105.929 622.02 105.446C621.614 104.786 621.467 104.204 621.593 103.433C621.708 102.736 621.466 101.975 621.018 101.443C620.628 100.98 620.59 100.664 620.897 100.2C621.221 99.7119 621.23 99.2945 620.707 98.8555C619.451 97.7997 619.461 97.7193 620.169 96.1273C620.278 96.0104 620.004 95.9475 620.141 96.0288C620.159 96.0392 620.131 96.069 620.085 96.1345C619.913 96.3744 619.809 96.7864 619.402 96.3816C619.192 95.8329 619.415 95.2437 619.236 94.692C619.165 91.9499 619.364 89.2138 619.379 86.4739C619.384 85.8503 619.516 85.1969 619.144 84.6141Z" fill="#AC0000" />
                    <path d="M628.86 125.303C629.121 125.343 629.404 125.341 629.543 125.634C629.844 125.942 630.218 125.797 630.559 125.777C631.431 125.73 631.667 126.333 631.704 126.989C631.751 127.805 631.105 127.789 630.528 127.777C630.134 127.769 629.74 127.747 629.051 127.795C629.87 128.04 630.425 128.203 630.836 128.642C631.207 129.038 631.436 129.571 630.972 129.891C629.661 130.796 630.563 130.843 631.309 130.929C631.192 130.676 630.447 130.912 630.649 130.425C630.855 129.929 631.41 129.609 631.959 129.526C632.343 129.468 632.856 129.622 632.862 130.105C632.877 131.353 633.384 132.305 634.357 133.046C634.489 133.146 634.549 133.337 634.484 133.48C634.153 134.198 634.7 134.254 635.109 134.63C635.773 135.241 636.358 136.045 636.655 136.97C636.653 137.353 636.404 137.609 636.185 137.881C634.519 140.087 632.827 142.271 630.551 143.908C630.665 142.791 631.213 141.93 632.121 141.295C632.472 141.051 632.966 140.927 632.771 140.228C632.406 140.213 632.081 140.762 631.657 140.432C631.286 140.144 631.286 139.662 631.08 139.302C630.716 140.075 630.351 140.815 630.076 141.607C629.823 142.337 629.241 142.985 628.244 142.679C628.055 142.209 628.347 141.908 628.622 141.601C628.917 141.334 629.166 141.041 629.177 140.613C629.281 139.384 629.705 138.173 629.435 136.928C629.173 135.722 628.564 134.705 627.615 133.901C627.287 133.623 626.859 133.419 626.832 132.903C627.021 132.422 627.62 132.594 627.965 132.156C627.222 131.941 626.762 131.3 626.032 131.099C625.778 131.03 625.601 130.881 625.598 130.607C625.588 129.412 624.984 128.81 623.798 128.757C623.599 128.748 623.426 128.631 623.316 128.447C623.32 128.17 623.524 128.033 623.71 127.889C624.62 127.188 624.934 126.265 624.74 125.151C624.693 124.878 624.62 124.604 624.775 124.339C625.402 123.988 626.034 124.174 626.667 124.316C626.776 124.364 626.876 124.426 626.972 124.496C627.503 124.994 628.366 124.721 628.86 125.303Z" fill="#A10000" />
                    <path d="M584.477 111.078C585.626 107.122 587.115 103.311 589.329 99.8146C589.519 99.5165 589.726 99.2289 589.926 98.9371C590.229 98.7104 590.262 98.3001 590.526 98.0482L590.526 98.0462C590.693 97.8864 590.85 97.6868 591.115 97.8827C591.484 98.3905 591.676 98.8642 590.928 99.2298C590.297 99.5381 590.195 99.902 590.83 100.353C591.084 100.535 591.34 100.797 591.148 101.159C590.983 101.473 590.673 101.35 590.399 101.337C589.655 101.306 589.655 101.313 589.025 101.999C590.375 101.256 591.683 101.672 592.235 103.007C592.323 103.219 592.317 103.422 592.175 103.56C591.415 104.295 591.889 104.684 592.564 105.028C592.748 105.423 592.511 105.726 592.295 105.988C591.615 106.812 591.693 107.45 592.69 107.916C593.145 108.788 593.565 109.678 594.24 110.416C594.422 110.616 594.568 110.869 594.43 111.171C593.683 111.475 592.952 111.068 592.197 111.116C591.47 111.162 590.788 111.232 590.107 111.588C590.614 111.857 591.248 111.909 591.411 112.567C591.511 112.976 591.537 113.387 591.141 113.644C590.781 113.878 590.458 113.699 590.181 113.427C589.875 113.126 589.673 112.707 589.126 112.546C589.531 112.946 589.951 113.213 590.235 113.613C590.475 113.951 590.71 114.334 590.321 114.674C589.964 114.987 589.656 114.654 589.381 114.439C589.227 114.318 589.124 114.136 588.942 114.041C588.865 113.9 588.81 114.163 588.922 114.141C589.045 114.116 589.221 114.29 589.209 114.464C589.152 115.24 588.51 115.204 587.982 115.32C587.903 115.337 587.828 115.359 587.716 115.428C588.131 115.666 588.443 115.386 588.765 115.279C589.275 115.108 589.776 115.03 590.272 115.298C590.634 115.495 590.98 115.75 590.924 116.211C590.865 116.682 590.434 116.654 590.083 116.702C589.701 116.754 589.207 116.637 589.032 117.088C588.868 117.51 589.322 117.686 589.558 117.933C589.751 118.135 589.998 118.321 589.851 118.646C589.714 118.947 589.402 118.919 589.135 118.989C588.415 119.175 587.606 118.792 586.936 119.428C586.708 119.644 586.335 119.324 586.163 119.041C585.884 118.579 585.762 118.087 586.051 117.574C586.501 117.447 586.957 117.462 587.411 117.452C586.939 117.412 586.472 117.42 586.019 117.623C585.629 117.391 585.248 116.965 584.841 117.617C584.8 117.683 584.591 117.622 584.547 117.504C584.257 116.722 584.422 115.919 584.555 115.15C584.646 114.627 585.094 114.28 585.686 114.242C585.84 114.232 585.993 114.34 586.223 114.207C585.768 113.872 586.21 112.899 585.492 112.938C584.837 112.975 584.784 113.792 584.696 114.387C584.654 114.667 584.619 114.973 584.251 114.993C583.956 115.01 583.841 114.803 583.817 114.532C584.1 113.393 584.122 112.203 584.477 111.078Z" fill="#9C0000" />
                    <path d="M583.976 114.868C584.482 114.891 584.352 114.574 584.383 114.239C584.481 113.212 584.787 112.31 586.116 112.408C586.413 112.94 585.788 113.798 586.73 114.099C586.886 114.148 586.789 114.316 586.697 114.374C586.481 114.508 586.358 114.816 585.995 114.681C585 114.31 584.771 114.811 584.794 115.706C584.807 116.251 584.668 116.799 584.594 117.369C585.047 117.373 585.067 117.012 585.262 116.844C585.518 116.625 585.791 116.171 586.138 116.524C586.538 116.929 585.88 116.948 585.77 117.181C585.642 117.449 585.874 117.502 586.062 117.563C586.11 117.835 586.181 118.106 586.2 118.381C586.229 118.772 586.392 119.073 586.736 119.25C586.816 119.291 586.996 119.26 587.06 119.194C587.462 118.78 586.632 118.676 586.888 118.176C587.721 118.946 588.691 118.715 589.657 118.635C589.658 118.502 589.673 118.454 589.656 118.431C589.286 117.941 588.255 117.874 588.539 116.996C588.809 116.16 589.623 116.396 590.281 116.409C590.437 116.412 590.613 116.435 590.69 116.252C590.791 116.017 590.621 115.878 590.468 115.757C590.113 115.474 589.727 115.265 589.255 115.443C588.921 115.568 588.602 115.818 588.267 115.833C587.837 115.854 587.158 116.225 587.005 115.619C586.864 115.061 587.619 115.206 587.95 114.996C588.011 114.957 588.104 114.962 588.183 114.958C588.494 114.941 588.923 115.019 588.97 114.614C589.032 114.093 588.365 114.418 588.211 114.106C589.207 112.771 589.471 114.77 590.297 114.523C590.299 113.681 589.485 113.45 589.076 112.933C588.931 112.75 588.436 112.792 588.671 112.38C588.867 112.035 589.117 112.243 589.426 112.317C589.852 112.417 590.006 112.617 590.17 112.956C590.323 113.271 590.519 113.63 590.977 113.506C591.198 113.447 591.24 113.211 591.223 113.012C591.187 112.603 591.104 112.198 590.6 112.117C590.032 112.026 589.481 111.931 589.405 111.254C591.083 110.906 592.748 110.465 594.427 111.137C595.616 110.845 596.809 110.767 598.009 111.071C597.733 111.976 597.049 112.029 596.288 111.875C595.567 111.728 595.592 112.093 595.793 112.57C595.551 112.753 595.399 112.573 595.236 112.482C594.965 112.331 594.717 112.079 594.419 112.474C594.184 112.784 594.227 113.089 594.395 113.366C594.557 113.631 594.835 113.825 595.001 114.088C595.277 114.525 595.22 115.141 594.737 115.163C593.274 115.228 592.856 116.595 592.747 117.349C592.549 118.721 591.698 118.27 591.03 118.454C590.817 118.148 591.035 117.622 590.391 117.401C590.654 118.441 590.03 119.108 589.525 119.808C589.37 120.023 589.176 120.189 589.435 120.389C590.434 121.163 589.306 121.214 589.043 121.505C589.052 121.983 589.621 121.974 589.675 122.476C589.149 122.528 588.616 122.007 588.139 122.355C587.299 122.971 588.384 123.104 588.5 123.57C588.008 123.757 587.493 123.493 587.008 123.695C586.525 123.896 586.26 124.225 585.967 124.738C586.081 123.51 585.075 122.766 584.762 121.701C584.653 122.468 583.755 123.252 584.914 123.993C585.221 124.19 585.205 124.475 585.067 124.724C584.969 124.901 584.984 125.319 584.508 125.046C584.094 124.807 584.268 125.218 584.228 125.413C584.043 126.326 584.711 127.042 584.78 127.92C584.842 128.714 584.9 129.5 584.861 130.296C584.279 129.72 584.408 128.91 584.174 128.219C584.015 127.889 584.009 127.516 583.883 127.177C583.716 125.867 583.549 124.559 583.381 123.25C583.265 122.65 583.443 122.021 583.016 121.443C582.738 121.067 582.767 120.479 582.952 120.053C583.52 118.74 583.471 117.345 583.613 115.973C583.653 115.582 583.627 115.159 583.976 114.868Z" fill="#A20000" />
                    <path d="M636.546 136.961C636.374 136.162 634.886 136.139 635.366 134.956C635.025 134.876 634.656 134.855 634.352 134.702C634.04 134.546 633.17 134.563 634.078 133.831C634.651 133.368 633.688 133.307 633.655 133.188C633.369 132.161 632.278 131.435 632.485 130.26C632.615 129.526 632.018 129.946 631.816 129.756C631.795 130.425 631.033 130.071 630.793 130.456C631.063 130.915 631.814 130.472 631.965 131.237C631.588 131.214 631.256 131.141 630.905 131.104C630.496 131.06 630.018 131.313 629.859 130.726C629.698 130.132 630.253 130.073 630.601 129.867C631.135 129.55 631.009 129.306 630.637 128.866C630.043 128.159 629.023 128.425 628.385 127.668C629.104 127.316 629.836 127.48 630.542 127.457C630.898 127.446 631.438 127.744 631.457 127.081C631.472 126.566 631.367 126.04 630.629 126.007C630.251 125.99 629.808 126.037 629.544 125.635C630.428 125.682 631.392 125.223 632.039 126.398C632.287 126.848 633.058 127.088 633.625 126.282C633.978 125.782 634.639 126.148 634.733 126.584C634.794 126.868 634.624 127.116 635.048 126.983C635.309 126.901 635.728 126.785 635.487 126.325C635.382 126.126 635.08 126.043 635.164 125.656C635.665 125.722 636.183 125.789 636.67 125.852C636.914 125.594 636.674 125.448 636.623 125.298C636.059 123.634 636.056 123.643 637.678 123.219C637.884 123.165 638.161 123.086 638.219 123.253C638.579 124.283 639.518 123.891 640.197 124.071C641.737 124.479 642.033 125.142 641.249 126.658C640.668 125.988 640.668 125.988 641.279 125.687C640.979 125.243 640.488 125.427 640.097 125.317C639.766 125.223 639.304 125.308 639.238 124.84C639.181 124.429 638.913 124.328 638.677 124.487C638.378 124.689 638.625 125.014 638.783 125.208C638.977 125.447 639.292 125.586 639.495 125.82C639.732 126.093 639.693 126.459 639.466 126.696C639.216 126.957 639.082 126.515 638.921 126.497C638.082 126.406 637.234 126.389 636.136 126.335C636.626 126.886 636.997 127.162 637.483 127.057C638.695 126.793 639.228 127.445 639.529 128.481C639.994 128.491 639.839 127.493 640.456 127.867C641.008 128.202 640.76 128.683 640.542 129.131C640.457 129.305 640.44 129.513 640.391 129.706C640.414 130.128 640.257 130.522 640.203 130.931C640.089 131.14 640.09 131.401 639.912 131.581C639.461 132.481 639.01 133.382 638.559 134.282C638.413 134.431 638.268 134.411 638.126 134.275C637.802 133.868 637.312 133.759 636.963 134.04C636.521 134.397 636.163 134.912 636.409 135.706C636.427 135.419 636.438 135.682 636.458 135.591C636.662 134.632 636.652 133.416 638.193 134.38C638.327 134.707 638.19 134.963 637.982 135.201L637.972 135.194C637.706 135.451 637.643 135.836 637.397 136.106C637.195 136.4 636.993 136.695 636.79 136.99C636.694 137.086 636.614 137.076 636.546 136.961Z" fill="#990000" />
                    <path d="M592.524 105.091C590.883 104.861 590.89 104.866 591.756 103.585C591.854 103.439 592.203 103.395 591.97 103.036C591.036 101.597 590.283 101.479 588.871 102.598C588.757 102.688 588.609 102.734 588.431 102.825C588.832 101.01 589.332 100.679 590.938 101.113C591.064 100.69 590.67 100.482 590.469 100.421C589.036 99.9883 589.982 99.3077 590.452 99.1489C591.261 98.8759 590.994 98.3511 591.034 97.8623C590.864 97.6001 590.933 97.3741 591.139 97.1679C591.74 96.6199 591.969 95.7269 592.787 95.3786C593.795 96.9153 594.801 97.2165 596.427 96.467C596.778 96.3049 596.778 96.3049 597.767 97.0274C597.72 96.0694 597.856 95.1835 597.762 94.2778C597.674 93.4395 598.1 93.1146 599.04 93.1743C599.228 93.5316 599.141 93.9085 599.126 94.2807C599.038 95.2011 598.795 96.1174 599.067 97.0451C599.142 97.4422 599.143 97.8648 599.452 98.1833C600.515 99.8191 602.054 100.664 603.959 100.908C604.349 100.958 604.747 100.989 605.106 101.18C605.215 101.247 605.294 101.34 605.344 101.457C604.021 102.208 602.764 101.273 601.298 101.177C601.654 101.725 602.369 101.916 602.02 102.556C601.807 102.945 601.218 103.475 601.126 103.393C600.575 102.902 599.409 103.481 599.284 102.334C599.245 101.981 598.937 102.091 598.734 102.022C598.732 101.414 599.263 101.427 599.763 101.177C598.717 100.691 597.754 100.225 596.811 99.7206C596.556 99.5835 594.374 100.536 594.271 100.772C594.747 100.796 593.992 101.568 594.824 101.546C596.13 101.512 597.522 101.157 598.734 102.024C598.529 102.373 597.919 101.98 597.852 102.43C597.782 102.912 598.329 102.847 598.594 103.041C598.87 103.243 599.103 103.505 599.348 103.733C598.997 104.435 597.191 103.65 597.825 105.284C597.677 105.444 597.486 105.502 597.277 105.521C596.284 105.436 595.292 105.392 594.311 105.642C593.68 105.566 593 105.655 592.524 105.091Z" fill="#A20000" />
                    <path d="M627.366 90.2583C626.557 90.2237 625.973 91.3417 624.902 90.7275C625.427 90.3672 626.129 90.4888 626.306 89.8089C626.267 89.7676 626.226 89.6957 626.164 89.6634C625.814 89.4848 625.062 89.5927 625.271 89.0068C625.424 88.579 625.963 88.2859 626.63 88.769C627.352 89.2914 628.321 88.9505 629.153 88.9297C629.692 88.9171 628.913 88.4073 629.094 88.0951C629.269 87.9383 629.428 87.959 629.574 88.1363C631.798 89.8352 634.069 91.4819 635.807 93.7216C635.922 93.8697 635.991 94.0541 636.081 94.2211C636.233 95.0385 635.672 94.9484 635.21 94.8511C634.423 94.6843 633.641 94.771 632.623 94.7738C633.239 95.0546 633.678 95.1097 634.121 95.0978C634.874 95.0787 635.318 95.4158 635.447 96.1616C635.476 96.2733 635.488 96.3867 635.487 96.5016C634.954 97.6495 634.408 97.8224 633.302 97.477C632.329 97.173 631.316 97.601 630.306 97.5614C629.157 97.5169 628.876 97.3664 628.689 96.1783C628.941 94.9788 628.912 93.8506 627.949 92.9197C627.786 92.7624 627.706 92.517 627.818 92.2684C628.104 92.0656 628.35 91.8293 628.459 91.4967C628.122 91.0373 626.594 91.6666 627.366 90.2583C627.651 89.9727 628.026 90.085 628.407 90.0297C627.907 89.5572 627.59 89.7046 627.366 90.2583Z" fill="#A00000" />
                    <path d="M598.938 93.1036C598.324 93.424 597.874 93.7034 598.169 94.6211C598.407 95.3599 597.902 96.2119 598.293 97.0615C598.519 97.5517 597.974 97.5242 597.608 97.525C596.981 97.5251 597.001 97.0195 596.832 96.4712C595.982 97.9439 594.894 97.2497 593.867 96.9205C593.147 96.6898 592.544 96.318 592.787 95.3834C593.3 94.3188 594.235 93.6144 595.054 92.8285C597.235 90.7372 599.671 88.9786 602.327 87.5361C602.7 87.3335 603.083 87.0787 603.549 87.1111C603.303 88.4062 602.155 88.3931 601.235 88.7303C600.996 88.8181 600.328 88.6657 600.749 89.3256C601.032 89.7667 601.155 90.4614 601.931 90.1922C602.184 90.105 602.435 89.923 602.609 89.7177C603.522 88.6384 604.562 88.9309 605.667 89.3357C606.142 89.5094 606.682 89.5071 607.195 89.5707C607.637 89.6262 608.076 89.6731 608.261 90.1753C608.182 90.2709 608.082 90.3365 607.964 90.3715C607.184 90.5464 606.487 90.109 605.729 90.0719C603.163 89.946 601.184 91.0106 599.619 92.9732C599.414 93.123 599.2 93.2394 598.938 93.1036Z" fill="#A60000" />
                    <path d="M628.991 96.2518C628.91 96.698 629.079 97.2404 629.471 97.1834C630.37 97.0533 631.314 97.6319 632.201 96.9253C632.482 96.7017 633.104 96.8158 633.499 97.0507C634.276 97.5117 634.811 97.3282 635.284 96.3702C635.592 96.2519 635.738 96.6793 636.047 96.5904C636.196 96.5473 636.358 96.6449 636.698 96.5348C636.115 96.4631 635.695 96.4438 635.284 96.3702C635.087 95.6538 634.733 95.3023 633.881 95.4243C633.245 95.5152 632.534 95.3803 631.979 94.6275C633.088 94.3422 634.137 94.2657 635.172 94.5263C635.613 94.6372 635.921 94.775 636.081 94.223C636.988 94.9661 637.61 95.9213 638.121 96.9599C638.666 97.6772 638.76 98.2339 637.769 98.7172C637.231 98.98 636.858 99.5637 636.271 99.8041C636.409 100.508 637.603 100.403 637.302 101.257C637.146 101.701 636.68 101.836 636.196 101.695C635.976 101.253 635.462 101.422 635.14 101.191C635.029 101.088 635.081 100.922 634.996 100.809C634.851 101.024 635.111 101.073 635.161 101.21C635.393 101.465 635.797 101.241 636.021 101.52C635.864 102.095 636.474 102.838 635.64 103.265C635.527 103.279 635.419 103.263 635.315 103.211C634.671 101.9 633.565 102.162 632.473 102.378C632.428 102.346 632.382 102.313 632.337 102.279C631.535 101.981 630.888 101.06 629.847 101.697C629.603 101.846 629.659 101.991 629.688 102.177C629.306 102.439 628.913 102.278 628.543 102.169C628.168 102.059 627.712 101.93 627.765 101.419C627.81 100.98 628.217 100.908 628.586 100.889C629.159 100.86 629.406 100.513 629.564 100.01C629.68 99.6419 630.159 99.2575 630.333 99.5503C630.786 100.317 631.436 99.6897 631.918 99.944C631.761 99.9155 632.003 99.9359 631.98 99.9339C630.808 99.834 630.238 99.3756 630.792 98.1186C629.999 97.8208 628.93 98.0015 628.289 97.1164C628.225 96.5857 628.361 96.2183 628.991 96.2518Z" fill="#990000" />
                    <path d="M610.854 151.993C610.483 151.84 609.981 152.026 609.732 151.558C609.683 151.437 609.716 151.341 609.819 151.267C609.924 151.216 610.034 151.183 610.148 151.166C611.332 151.18 612.506 150.962 613.906 151.145C613.537 150.59 613.114 150.539 612.817 150.327C612.309 149.964 612.062 149.515 612.22 148.889C612.382 148.244 612.759 148.177 613.283 148.496C613.345 148.533 613.446 148.497 613.506 148.442C614.395 147.619 615.327 147.866 616.27 148.364C615.464 147.793 616.078 147.493 616.472 147.145C616.35 146.782 615.9 146.743 615.737 146.428C615.512 145.997 615.672 145.381 616.07 145.601C617.236 146.244 618.016 145.259 618.983 145.16C618.076 144.186 618.076 144.09 618.968 143.485C619.394 143.416 619.761 143.632 620.152 143.732C620.261 143.771 620.364 143.822 620.465 143.877C621.709 144.469 621.865 145.656 621.956 146.807C622.004 147.424 621.391 147.691 620.897 147.925C620.865 147.996 620.807 148.025 620.731 148.006C620.86 148.072 620.872 147.891 620.978 147.89C622.322 148.478 621.117 148.976 620.925 149.51C620.834 149.655 620.714 149.771 620.576 149.87L620.582 149.881C620.281 150.104 619.896 150.085 619.571 150.239C618.896 150.477 618.219 150.716 617.544 150.953C617.191 151.032 616.836 151.1 616.504 151.252C614.646 151.69 612.755 151.879 610.854 151.993Z" fill="#B41113" />
                    <path d="M635.608 103.189C636.265 102.784 635.336 101.94 636.062 101.554C636.489 101.511 637.071 101.549 637.144 101.053C637.206 100.633 636.592 100.727 636.311 100.538C636.056 100.364 635.652 100.251 635.691 99.8902C635.731 99.5132 636.081 99.3228 636.45 99.2649C637.243 99.1392 637.397 98.1053 638.295 98.0184C638.549 97.9939 637.962 97.368 638.122 96.9592C639.399 98.4392 640.093 100.233 640.821 102.006C640.925 102.263 640.969 102.538 641.198 102.724C641.411 103.033 641.303 103.457 641.563 103.75C641.666 104.242 641.77 104.734 641.873 105.227C642.081 106.029 641.691 106.264 641.09 105.85C640.117 105.18 639.019 104.955 637.953 104.566C637.161 104.278 636.205 103.952 635.608 103.189Z" fill="#920000" />
                    <path d="M628.274 142.643C629.278 142.383 629.98 141.883 630.018 140.712C630.042 139.927 631.145 139.542 630.82 138.562C631.296 138.967 631.625 139.363 631.609 139.966C631.603 140.174 631.752 140.346 631.999 140.308C632.107 140.291 632.278 140.225 632.295 140.152C632.334 139.972 631.86 139.539 632.517 139.698C632.905 139.792 633.196 140.029 633.263 140.515C633.315 140.894 633.255 141.243 632.928 141.302C631.446 141.566 631.298 143.001 630.552 143.906C629.039 145.505 627.255 146.719 625.246 147.61C624.679 146.948 624.885 146.545 625.674 146.347C626.342 146.18 626.849 145.808 627.33 145.219C626.995 145.186 626.922 145.346 626.813 145.451C626.023 146.201 625.793 146.151 625.364 145.133C625.285 144.947 625.125 144.815 625.044 144.63C625.012 144.419 625.049 144.202 625.242 144.115C626.074 143.739 626.778 143.167 627.526 142.66C627.755 142.509 628.018 142.388 628.274 142.643Z" fill="#A60000" />
                    <path d="M625.103 144.642C625.366 144.852 626.318 144.453 625.76 145.389C625.656 145.564 625.714 145.704 625.925 145.704C626.07 145.704 626.281 145.682 626.35 145.588C626.552 145.308 626.633 144.953 626.973 144.756C627.214 144.615 627.391 144.562 627.575 144.809C627.742 145.032 627.968 145.254 627.627 145.503C627.062 145.917 626.594 146.65 625.889 146.641C624.96 146.63 625.224 147.139 625.247 147.612C624.118 148.569 622.714 148.974 621.385 149.533C621.125 149.624 620.874 149.647 620.656 149.435C620.666 149.107 620.961 149 621.14 148.798C621.543 148.347 621.34 148.097 620.83 147.977C620.852 147.401 622.105 147.118 621.541 146.709C620.638 146.057 622.087 145.815 621.575 145.361C621.137 144.972 620.77 144.505 620.37 144.072C620.55 143.888 620.789 143.823 621.02 143.877C622.095 144.125 623.181 144.25 624.285 144.242C624.604 144.24 624.895 144.376 625.103 144.642Z" fill="#AF0007" />
                    <path d="M613.642 84.1407C613.375 84.2552 613.107 84.3696 612.84 84.4841C611.937 84.1257 611.096 84.8119 610.204 84.6384C610.89 83.6457 610.44 82.5535 610.453 81.5095C610.469 80.1683 610.222 78.8302 610.389 77.4825C610.465 76.8632 610.712 76.4103 611.385 76.3455C612.08 76.2786 612.385 76.7156 612.532 77.3124C612.973 79.1144 612.871 80.9355 612.587 82.7348C612.436 83.6833 612.503 84.2587 613.642 84.1407Z" fill="#2C241E" />
                    <path d="M627.308 86.8666C626.462 86.8384 625.926 85.9568 625.038 86.0451C624.878 85.9335 624.795 85.7896 624.843 85.5891C624.858 83.9666 624.519 82.3513 624.736 80.7248C624.763 80.5276 624.771 80.3249 624.819 80.1335C624.967 79.5416 625.188 78.8181 625.864 78.8889C626.495 78.9548 626.674 79.6748 626.72 80.295C626.851 82.0334 627.072 83.7764 626.758 85.5114C626.645 86.132 626.988 86.4721 627.308 86.8666Z" fill="#2C251E" />
                    <path d="M635.608 103.189C636.722 103.426 637.543 104.36 638.78 104.393C639.631 104.416 640.358 105 641.031 105.547C641.475 105.909 641.824 105.941 641.873 105.227C642.145 105.505 642.215 105.857 642.239 106.225C642.346 106.408 642.329 106.568 642.158 106.703C640.882 105.946 639.516 105.452 638.036 105.288C637.58 105.236 637.214 105.098 637.01 104.626C636.657 103.807 635.808 103.548 635.14 103.691C633.826 103.972 633.189 102.854 632.181 102.561C632.234 102.467 632.285 102.373 632.338 102.279C633.446 102.236 634.614 101.986 635.371 103.156L635.49 103.173L635.608 103.188L635.608 103.189Z" fill="#880000" />
                    <path d="M638.121 134.269C638.267 134.274 638.412 134.278 638.557 134.283C638.563 134.714 638.441 135.064 637.98 135.202C638.026 134.891 638.071 134.581 638.118 134.27L638.121 134.269Z" fill="#990000" />
                    <path d="M640.005 130.877C640.013 130.447 640.122 130.051 640.389 129.706C640.465 129.717 640.541 129.726 640.617 129.732C640.586 129.968 640.556 130.205 640.526 130.442C640.312 130.539 640.446 131.052 640.005 130.877Z" fill="#990000" />
                    <path d="M592.768 144.291C592.771 144.163 592.774 144.034 592.776 143.906C592.281 143.308 592.881 143.217 593.336 143.026C592.182 142.14 591.16 141.293 591.253 139.764C591.262 139.618 591.334 139.746 591.219 139.662C589.447 138.37 590.671 137.271 591.444 136.148C590.229 135.458 590.099 134.869 590.921 133.803C591.033 133.805 591.138 133.832 591.236 133.886C591.701 134.391 592.045 135.016 592.674 135.365C593.24 135.82 594.03 135.976 594.422 136.665C594.516 136.888 594.559 137.112 594.448 137.342C594.225 137.719 593.771 137.709 593.372 137.961C594.02 138.389 594.484 138.855 594.27 139.72C594.141 140.245 594.596 140.242 594.984 140.191C595.556 140.116 595.991 140.184 596.078 140.924C596.166 141.67 596.214 142.209 595.21 141.731C594.911 141.588 594.589 141.738 594.267 141.787C595.28 141.737 596.105 142.448 597.176 142.343C597.967 142.266 598.689 143.394 598.611 144.224C598.578 144.579 598.457 144.919 598.507 145.291C598.588 145.888 598.8 146.267 599.499 146.093C600.005 145.969 600.541 146.154 601.044 145.972C601.349 145.862 601.595 145.901 601.748 146.208C601.909 146.531 601.777 146.769 601.538 146.966C603.048 145.869 604.381 147.07 605.795 147.388C605.155 147.274 604.656 146.817 604.027 146.682C603.779 146.629 603.703 146.35 603.728 146.09C603.759 145.747 603.899 145.474 604.253 145.367C604.954 145.155 605.597 145.171 606.078 145.832C606.521 146.443 607.112 146.78 607.872 146.852C608.411 146.903 609.01 147.171 609.066 146.249C609.083 145.982 609.335 145.861 609.602 145.888C609.867 145.916 610.032 146.084 610.098 146.339C610.21 146.777 610.114 147.212 610.074 147.649C610.014 148.049 609.994 148.46 609.795 148.827C608.993 149.422 609.4 150.317 609.245 151.072C609.19 151.17 609.122 151.256 609.039 151.331C608.394 151.961 607.647 151.573 607.008 151.421C604.079 150.722 601.152 149.987 598.515 148.445C598.248 148.195 597.865 148.131 597.602 147.872C597.102 147.761 596.847 147.178 596.284 147.187C594.891 146.49 593.729 145.512 592.768 144.291Z" fill="#B81F1E" />
                    <path d="M609.04 151.33C609.046 151.239 609.053 151.147 609.06 151.056C609.344 150.499 609.044 149.839 609.373 149.289C609.881 148.76 609.942 148.041 609.984 147.402C610.104 145.553 610.734 143.826 611.168 142.06C612.46 136.8 613.464 131.48 614.599 126.186C616.218 117.771 616.932 109.232 618.128 100.761C618.25 99.4546 618.612 98.1725 618.527 96.8455C619.048 93.1811 618.97 89.4883 619.047 85.8024C619.056 85.4062 619.112 85.0102 619.145 84.6142C619.749 84.7218 619.728 85.2113 619.719 85.6367C619.662 88.6928 619.584 91.7483 619.513 94.8047C619.486 97.2173 619.605 99.6359 619.17 102.03C619.056 102.656 618.979 103.291 619.106 103.928C619.128 104.982 618.952 106.015 618.793 107.051C618.04 112.105 617.418 117.177 616.794 122.247C616.286 126.376 615.29 130.402 614.414 134.455C613.926 136.712 613.666 139.009 613.005 141.241C612.393 143.304 611.801 145.374 611.162 147.43C611.055 147.777 611.007 148.13 610.945 148.483C610.699 149.51 610.472 150.545 609.761 151.381C609.74 151.439 609.731 151.5 609.732 151.56C609.444 151.656 609.257 151.447 609.04 151.33Z" fill="#CE5251" />
                    <path d="M591.189 133.956C590.232 134.072 591.197 134.66 590.96 134.906C590.336 135.554 590.815 135.439 591.296 135.538C591.639 135.61 591.922 135.973 592.295 136.254C591.243 136.663 590.65 137.371 590.625 138.44C590.603 139.361 591.505 139.188 592 139.498C591.131 140.468 591.711 141.529 593.921 143.035C593.775 143.636 592.703 143.017 592.775 143.905C590.59 142.154 588.913 140.013 587.816 137.428C587.736 136.549 587.866 135.644 586.997 134.969C586.664 134.711 586.832 134.068 586.884 133.6C586.989 132.65 587.126 131.703 587.248 130.755C587.318 130.205 587.343 129.777 588.106 129.568C588.849 129.365 588.416 128.187 589.106 127.693C589.317 127.541 590.31 127.039 589.108 126.696C588.944 126.648 589.027 126.329 589.116 126.149C589.208 125.962 589.362 125.818 589.584 125.852C589.88 125.897 590.148 126.076 590.175 126.364C590.211 126.755 590.133 127.156 590.103 127.552C590.472 128.006 590.246 128.545 590.317 129.041C590.503 130.329 590.567 131.64 591.13 132.852C591.287 133.192 591.525 133.572 591.189 133.956Z" fill="#B10C10" />
                    <path d="M595.224 147.557C595.205 147.714 595.187 147.872 595.168 148.029C595.382 148.379 595.341 148.697 595.044 148.981C593.918 150.936 592.771 151.588 591.546 150.838C590.251 150.047 589.46 149.464 589.895 147.583C589.948 147.352 589.963 147.111 589.995 146.875C590.545 146.276 591.278 145.938 591.994 145.635C593.287 145.087 594.712 145.978 595.224 147.557Z" fill="#56231D" />
                    <path d="M579.996 145.575C578.573 144.429 578.44 143.039 579.652 141.766C579.814 141.598 580.028 141.483 580.083 141.232C581.506 140.351 582.794 140.669 584.008 141.672C584.665 142.985 584.593 144.185 583.811 144.95C582.547 146.186 581.564 146.347 579.996 145.575Z" fill="#65211B" />
                    <path d="M589.177 152.621C589.372 151.888 589.694 151.153 590.622 151.191C591.474 151.226 591.717 151.898 591.64 152.651C591.557 153.469 591.237 154.189 590.261 154.103C589.466 154.034 589.121 153.461 589.177 152.621Z" fill="#E9E2D8" />
                    <path d="M595.224 147.557C594.618 147.468 594.821 146.792 594.412 146.484C593.371 145.697 592.37 145.634 591.244 146.238C590.835 146.458 590.505 146.85 589.996 146.875C590.443 145.968 591.298 145.337 592.159 145.303C593.22 145.261 592.912 144.832 592.768 144.292C594.032 145.146 595.213 146.101 596.285 147.188C595.898 147.216 595.4 146.926 595.224 147.557Z" fill="#3D251E" />
                    <path d="M579.996 145.575C580.878 145.542 581.711 146.042 582.656 145.491C584.258 144.557 584.392 143.281 583.882 141.729C583.765 141.549 583.787 141.389 583.948 141.248C584.896 142.096 585.08 143.92 584.326 144.988C583.508 146.145 581.406 146.661 580.178 145.985C580.074 145.928 580.056 145.716 579.996 145.575Z" fill="#42251D" />
                    <path d="M580.749 147.76C580.633 148.375 580.316 148.91 579.533 148.853C578.863 148.804 578.548 148.308 578.637 147.69C578.741 146.969 579.145 146.41 579.973 146.473C580.698 146.529 580.817 147.071 580.749 147.76Z" fill="#E5DDD4" />
                    <path d="M587.205 147.85C586.686 147.672 586.827 147.325 586.822 147.022C586.816 146.681 587.053 146.244 586.681 146.028C586.317 145.817 586.044 146.223 585.738 146.378C585.415 146.542 585.081 147.12 584.761 146.734C584.408 146.31 584.957 145.947 585.264 145.679C585.835 145.182 586.528 144.564 587.246 145.242C587.931 145.89 587.6 146.808 587.398 147.62C587.371 147.722 587.249 147.8 587.205 147.85Z" fill="#D9D0C8" />
                    <path d="M583.949 141.248C583.927 141.408 583.905 141.569 583.883 141.729C582.695 140.956 581.428 140.802 580.083 141.232C581.047 140.178 582.46 140.183 583.949 141.248Z" fill="#46251D" />
                    <path d="M577.051 149.767C577.487 150.664 578.258 151.308 578.774 152.165C577.611 151.924 577.126 151.008 576.721 150.01C576.701 149.751 576.825 149.689 577.051 149.767Z" fill="#BFB7B0" />
                    <path d="M589.712 156.528C590.486 156.571 591.256 156.544 592.069 156.319C592.076 156.893 591.748 156.962 591.401 157.009C590.806 156.965 590.119 157.236 589.712 156.528Z" fill="#B5ADA6" />
                    <path d="M589.712 156.529C590.173 157.046 590.851 156.806 591.401 157.009C590.717 157.234 590.001 157.196 589.464 156.78C589.057 156.465 589.515 156.518 589.712 156.529Z" fill="#A19992" />
                    <path d="M595.044 148.981C595.085 148.664 595.127 148.346 595.169 148.029C595.488 148.103 595.618 148.298 595.553 148.622C595.497 148.905 595.298 148.981 595.044 148.981Z" fill="#3D251E" />
                    <path d="M597.603 147.872C598.023 147.878 598.361 148.015 598.516 148.444C598.087 148.451 597.745 148.32 597.603 147.872Z" fill="#72261C" />
                    <path d="M577.051 149.766C576.941 149.847 576.831 149.929 576.721 150.009C576.554 149.775 576.412 149.496 576.78 149.372C577.003 149.298 577.054 149.564 577.051 149.766Z" fill="#78716A" />
                    <path d="M621.317 110.79C622.102 109.588 622.717 108.273 623.711 107.211C624.495 106.511 625.257 105.778 626.241 105.348C626.602 105.321 626.975 105.365 627.304 105.158C627.596 105.039 627.91 105.007 628.21 104.922C628.262 104.917 628.314 104.915 628.366 104.912C629.875 105.058 631.402 105.07 632.873 105.51C633.566 105.868 634.35 106.052 634.952 106.587C635.12 106.95 635.56 107.024 635.765 107.348C636.374 108.582 637.536 109.512 637.751 110.962C638.025 111.254 637.809 111.7 638.074 111.995C638.609 113.985 637.94 115.817 637.324 117.655C637.011 117.886 637.11 118.381 636.737 118.572C635.6 119.543 634.86 120.913 633.55 121.715C633.038 122.029 632.57 122.408 631.919 122.325C631.585 122.555 631.18 122.65 630.846 122.884C629.835 123.416 628.795 123.266 627.751 123.024C627.634 122.99 627.521 122.941 627.414 122.884C626.936 122.513 626.351 122.404 625.792 122.228C623.994 121.258 622.538 119.95 621.627 118.084C621.397 117.612 621.151 117.16 621.195 116.614C621.294 116.155 621.079 115.796 620.818 115.449C620.286 113.822 620.467 112.27 621.317 110.79Z" fill="#2C251E" />
                    <path d="M626.336 105.612C625.305 105.888 624.726 106.908 623.712 107.211C623.79 106.88 623.706 106.508 624.147 106.307C624.659 106.074 624.638 106.03 624.71 105.315C624.715 105.269 624.781 105.224 624.826 105.19C626.01 104.279 626.058 103.368 624.947 102.499C625.371 102.113 625.879 102.592 626.348 102.329C626.261 101.225 625.371 101.302 624.628 101.211C624.341 101.176 624.007 101.225 623.996 100.854C623.987 100.554 624.317 100.6 624.536 100.528C625.171 100.32 625.166 100.306 624.903 99.2671C625.248 99.196 625.593 99.1239 626.072 99.0248C625.852 98.6795 625.236 98.7215 625.36 98.2303C625.741 97.8271 626.365 98.1503 626.751 97.7607C627.301 97.5731 627.626 96.7703 628.386 97.1586C629.45 97.6871 630.756 97.4748 631.747 98.2117C631.662 98.8753 630.634 98.1074 630.77 98.8581C630.872 99.424 631.359 99.7697 631.996 99.8374C632.213 99.8605 632.414 100.036 632.618 100.223C631.854 100.036 631.114 99.878 630.589 100.622C630.209 100.366 630.697 99.7461 630.204 99.7203C629.635 99.6897 629.932 100.222 629.838 100.521C629.647 101.128 629.128 101.333 628.53 101.236C628.273 101.194 628.017 101.114 627.956 101.418C627.893 101.736 628.24 101.766 628.441 101.837C628.847 101.978 629.271 102.068 629.688 102.177C629.953 102.437 630.45 102.63 630.373 103.009C630.297 103.383 629.847 103.103 629.564 103.13C629.288 103.299 628.989 103.306 628.402 103.202C628.977 103.328 629.113 103.562 629.233 103.812C629.411 104.18 628.617 104.075 628.901 104.494C628.665 104.559 628.484 104.695 628.366 104.912L628.381 104.941C628.113 105.103 627.831 105.092 627.545 105.014C627.287 104.85 627.008 104.62 626.979 105.194C626.825 105.43 626.519 105.426 626.336 105.612Z" fill="#A00000" />
                    <path d="M631.848 122.792C632.799 122.545 633.707 122.333 634.496 121.582C635.158 120.952 635.923 121.614 636.653 121.963C636.305 122.383 636.008 122.351 635.673 122.129C635.447 121.981 635.192 121.761 634.946 122.087C634.715 122.394 634.815 122.866 635.03 122.956C635.898 123.322 635.645 123.933 635.426 124.495C635.151 125.202 634.573 124.432 634.19 124.664C633.99 125.019 634.517 125.095 634.437 125.392C633.839 125.889 632.844 124.703 632.395 125.876C632.329 126.047 632.2 125.938 632.199 125.827C632.192 124.989 631.503 125.247 631.063 125.106C630.845 124.171 631.116 123.403 631.848 122.792Z" fill="#990000" />
                    <path d="M631.848 122.792C631.586 123.564 631.324 124.334 631.063 125.106C630.27 125.004 629.477 124.901 628.684 124.799C628.004 125.072 627.371 124.976 626.78 124.551L626.779 124.549C625.662 123.563 625.645 123.295 626.646 122.45C626.964 122.431 627.252 122.524 627.515 122.698L627.515 122.694C628.399 123.254 629.502 122.922 630.434 123.445C630.823 123.664 630.996 122.876 631.362 122.654C631.542 122.599 631.703 122.627 631.838 122.762L631.848 122.792Z" fill="#A10000" />
                    <path d="M628.903 104.494C628.692 104.111 629.058 104.008 629.235 103.812C629.969 103.813 630.667 104.359 631.515 103.76C631.474 104.457 631.262 104.882 630.757 104.686C630.129 104.444 629.508 104.644 628.903 104.494Z" fill="#990000" />
                    <path d="M634.893 106.732C634.255 106.267 633.346 106.248 632.874 105.51C633.899 105.566 634.843 105.78 635.383 106.789C635.205 106.898 635.041 106.892 634.893 106.732Z" fill="#6B1612" />
                    <path d="M629.234 103.812C628.761 103.37 628.046 103.526 627.53 103.116C628.223 102.847 628.895 103.089 629.565 103.131C629.455 103.358 629.344 103.586 629.234 103.812Z" fill="#990000" />
                    <path d="M626.781 124.55C627.415 124.633 628.05 124.715 628.685 124.798C628.743 124.967 628.802 125.136 628.86 125.304C628.184 125.006 627.2 125.557 626.781 124.55Z" fill="#990000" />
                    <path d="M631.84 122.762C631.684 122.756 631.528 122.751 631.373 122.746C631.192 122.849 631.034 122.813 630.897 122.663C631.077 122.06 631.531 122.29 631.92 122.326C631.893 122.472 631.866 122.617 631.84 122.762Z" fill="#5C211D" />
                    <path d="M636.738 118.573C636.82 118.195 636.749 117.718 637.325 117.657C637.267 118.05 637.411 118.573 636.738 118.573Z" fill="#6E1918" />
                    <path d="M638.075 111.995C637.5 111.798 637.719 111.351 637.752 110.963C638.346 111.155 638.114 111.605 638.075 111.995Z" fill="#5F1F1C" />
                    <path d="M634.893 106.732C635.056 106.751 635.219 106.77 635.383 106.789C635.687 106.855 635.834 107.028 635.766 107.349C635.394 107.258 634.914 107.321 634.893 106.732Z" fill="#5F1A18" />
                    <path d="M618.526 96.8454C618.829 98.1504 618.321 99.4013 618.274 100.684C618.369 101.85 618.066 102.978 617.928 104.12C617.543 107.29 617.111 110.455 616.703 113.618C616.484 114.29 616.251 114.96 616.093 115.656C616.032 115.927 615.855 116.176 615.518 116.166C615.163 116.155 614.918 115.961 614.824 115.621C614.745 115.335 614.954 114.863 614.549 114.802C613.847 114.693 613.388 113.966 612.569 114.145C611.948 114.281 611.263 114.312 611.056 113.443C611.048 113.267 611.086 113.101 611.162 112.942C611.426 112.591 611.715 112.244 611.285 111.818C611.082 111.573 610.908 111.309 610.798 111.009C610.413 110.479 609.959 110.482 609.461 110.833C609.276 111.021 609.074 111.19 608.869 111.354C608.428 111.649 608.415 112.159 608.251 112.591C608.083 112.912 607.842 113.124 607.486 112.9C606.994 112.591 606.83 112.121 606.955 111.552C606.865 111.771 606.898 111.997 606.908 112.227C606.941 113.046 606.442 113.038 606.007 112.662C605.245 112.003 604.715 112.033 603.822 112.605C603.259 112.965 602.303 113.496 601.409 112.91C601.004 112.646 600.984 113.111 600.832 113.289C600.439 113.748 600.064 113.849 599.684 113.282C599.832 112.15 599.832 112.15 601.372 110.252C601.089 109.888 600.299 110.35 600.25 109.485C600.224 109.011 599.797 108.705 600.614 108.41C601.23 108.189 601.495 107.374 601.592 106.711C602.083 106.55 601.837 107.381 602.31 107.115C602.386 107.073 602.424 106.906 602.423 106.797C602.421 106.343 602.051 106.371 601.749 106.291C601.374 106.193 601.083 106.475 600.686 106.552C600.543 105.783 600.921 105.484 601.518 105.303C602.632 104.968 603.53 104.537 603.532 103.068C603.534 102.367 604.348 102.214 605.046 102.361C605.814 102.524 606.133 102.283 605.814 101.486C605.82 101.238 605.93 101.041 606.106 100.875C607.782 100.045 609.372 99.116 610.309 97.3875C610.426 97.1728 610.677 97.0924 610.914 97.2977C611.56 97.4422 612.004 97.4968 611.744 96.5283C611.556 95.8252 611.309 94.941 612.37 94.5404C614.191 93.8524 614.739 93.8874 615.395 95.1284C615.93 96.1408 616.064 95.0328 616.476 94.9613C616.5 95.7904 616.242 96.7653 617.5 96.8047C617.579 96.807 617.701 97.0438 617.716 97.1798C617.771 97.7164 617.47 98.258 617.848 98.8003C618.166 99.2571 617.775 99.8063 618.07 100.34C618.223 99.1748 618.374 98.0106 618.526 96.8454Z" fill="#B50000" />
                    <path d="M610.916 97.2981C610.264 97.6984 610.118 98.5013 609.581 98.9861C608.568 99.9021 607.509 100.755 606.128 101.064C605.827 101.329 605.389 101.123 605.084 101.372C602.787 101.293 600.756 100.648 599.359 98.6704C599.274 98.5494 599.257 98.3809 599.208 98.2343C598.935 97.9478 599.182 97.4786 598.846 97.2151C598.209 96.2549 598.709 95.2642 598.768 94.2856C599.11 93.8833 599.052 93.294 599.417 92.9017C600.58 90.5884 604.252 89.0832 606.822 89.9307C607.195 90.0539 607.593 90.1036 607.981 90.1872C608.222 90.4849 608.663 90.4666 608.902 90.7679C609.79 91.5106 610.555 92.3483 610.979 93.4511C611.232 93.836 611.042 94.3266 611.28 94.7145C611.159 95.5761 611.038 96.4367 610.916 97.2981Z" fill="#2C251E" />
                    <path d="M611.281 94.7146C610.827 94.3782 610.902 93.915 610.98 93.4511C611.484 93.7759 611.387 94.2443 611.281 94.7146Z" fill="#771D19" />
                    <path d="M608.903 90.7681C608.518 90.6978 608.053 90.7553 607.981 90.1874C608.075 90.1834 608.168 90.1784 608.262 90.1744C608.584 90.2546 608.822 90.4277 608.903 90.7681Z" fill="#7C1A1E" />
                    <path d="M591.189 133.956C590.29 131.913 589.748 129.809 590.103 127.553C590.811 126.892 590.759 125.887 591.238 125.089C592.199 123.485 593.243 122.057 595.024 121.308C595.144 121.257 595.204 121.065 595.293 120.939C595.749 120.208 596.554 120.184 597.262 119.956C597.663 119.967 598.051 119.914 598.406 119.708C598.762 119.619 599.125 119.565 599.476 119.455C601.461 119.165 603.309 119.616 605.083 120.478C606.372 121.241 607.584 122.099 608.488 123.325C608.991 123.837 609.386 124.412 609.539 125.128C609.607 125.589 609.807 126.022 609.848 126.49C609.806 127.034 609.903 127.555 610.097 128.063C610.438 134.652 603.918 139.878 597.018 138.367C596.398 138.099 595.763 137.865 595.144 137.594C594.784 137.373 594.543 137.024 594.239 136.744C593.648 136.347 593.058 135.951 592.467 135.555C592.05 135.016 591.56 134.535 591.19 133.957L591.189 133.956Z" fill="#2C251E" />
                    <path d="M599.291 119.756C599.028 120.065 598.681 119.886 598.37 119.917C598.061 120.155 597.622 119.951 597.324 120.225C596.647 120.464 595.97 120.701 595.293 120.94C594.452 121.025 593.792 121.73 592.781 121.431C592.238 121.271 592.32 120.937 592.01 120.768C592.562 120.301 593.061 121.121 593.542 120.612C593.734 120.409 594.197 120.651 594.07 119.956C593.931 119.193 594.531 119.292 594.979 119.698C595.233 119.929 595.524 120.148 595.783 119.826C595.973 119.59 595.773 119.293 595.556 119.1C595.391 118.953 595.12 118.911 595.324 118.568C596.439 116.694 597.741 114.963 599.23 113.373C599.316 113.281 599.531 113.31 599.685 113.282C600.293 113.574 600.664 113.464 600.737 112.719C600.764 112.444 601 111.838 601.199 112.195C601.815 113.29 602.6 112.275 603.245 112.521C603.515 112.624 603.739 112.494 603.949 112.231C604.504 111.534 605.472 111.52 606.047 112.187C606.212 112.378 606.205 112.796 606.596 112.601C606.875 112.461 606.675 112.165 606.65 111.949C606.612 111.61 606.517 111.276 606.418 110.806C606.866 111.027 608.016 110.339 607.218 111.69C606.964 112.12 607.36 112.457 607.646 112.702C607.854 112.88 607.966 112.614 608.03 112.422C608.182 112.319 608.345 112.304 608.516 112.357C609.235 113.261 610.305 113.098 611.268 113.261C611.441 114.174 612.091 114.013 612.634 113.774C613.133 113.556 613.453 113.558 613.718 114.054C613.836 114.276 614.03 114.449 614.293 114.405C615.179 114.258 615.727 114.348 615.1 115.413C614.917 115.725 615.189 115.856 615.4 115.933C615.729 116.052 615.783 115.789 615.845 115.547C615.986 115.001 615.777 114.295 616.529 114.02C616.562 115.827 616.112 117.582 615.956 119.365C615.925 119.775 615.709 119.934 615.314 119.808C615.049 119.723 614.97 119.514 614.976 119.247C614.999 118.333 614.995 118.334 614.34 117.634C614.538 117.859 614.72 118.096 614.934 118.308C615.13 118.502 615.125 118.738 614.947 118.95C614.745 119.191 614.435 119.319 614.212 119.106C613.642 118.563 612.928 118.33 612.233 118.042C611.799 117.863 611.808 117.4 611.653 117.044C611.396 116.454 610.94 116.352 610.369 116.498C609.896 116.619 609.488 116.683 609.588 117.407C609.685 118.098 609.136 118.51 608.51 118.259C607.5 117.854 606.329 117.819 605.525 116.882C605.017 116.291 604.183 116.277 603.508 116.485C602.376 116.833 601.314 116.8 599.953 116.19C600.516 116.859 600.579 117.405 600.603 117.966C600.622 118.397 600.799 118.863 600.382 119.193C599.882 119.587 599.515 119.113 599.114 118.924C598.771 119.307 599.197 119.493 599.291 119.756Z" fill="#B50C0E" />
                    <path d="M594.411 105.329C595.368 104.844 596.344 105.077 597.319 105.253C597.54 105.577 598.032 105.477 598.231 105.836C599.557 107.176 599.973 108.928 598.007 111.067C596.82 111.481 595.625 111.404 594.426 111.131C593.702 110.161 592.679 109.362 592.627 108.006C592.245 106.665 592.841 105.771 594.411 105.329Z" fill="#2D251E" />
                    <path d="M598.231 105.836C597.848 105.765 597.378 105.833 597.319 105.253C597.487 105.264 597.655 105.276 597.822 105.286C598.107 105.359 598.265 105.525 598.231 105.836Z" fill="#6F1D18" />
                    <path d="M605.085 101.372C605.302 100.827 605.737 101.016 606.129 101.064C606.025 101.205 605.921 101.346 605.818 101.486C605.659 101.478 605.5 101.468 605.342 101.46C605.256 101.431 605.17 101.401 605.085 101.372Z" fill="#6B1F18" />
                    <path d="M591.028 118.448C591.078 118.707 591.299 118.966 591.059 119.227C590.963 119.332 590.824 119.293 590.78 119.161C590.679 118.869 590.747 118.617 591.028 118.448Z" fill="#A20000" />
                    <path d="M621.317 110.79C621.188 111.736 621.078 112.686 620.923 113.629C620.811 114.315 620.891 114.962 621.161 115.594C621.381 115.862 621.329 116.172 621.293 116.479C621.235 117.891 622.089 118.987 622.931 119.85C624.156 121.11 624.224 121.966 622.631 123.18C622.455 123.248 622.273 123.278 622.086 123.281C621.72 123.258 621.356 123.224 621.008 123.095C620.574 122.943 620.376 122.179 619.707 122.611C619.524 122.728 619.23 122.664 619.201 122.462C619.017 121.173 617.153 121.376 617.067 120.028C616.998 118.947 617.341 117.889 617.26 116.803C617.636 113.925 618.013 111.051 618.378 108.175C618.427 107.79 618.585 107.4 618.416 107.005C618.547 105.975 618.677 104.946 618.808 103.917C618.728 102.593 619.019 101.302 619.227 100.014C619.416 98.8448 618.945 97.6249 619.543 96.5026C619.956 96.147 619.974 95.3677 620.733 95.3454C621.058 96.0634 620.337 96.3488 620.135 96.8106C619.798 97.5825 620.046 98.0576 620.585 98.4594C621.848 99.4011 621.87 99.4362 620.876 100.8C621.618 101.309 622.115 102.87 621.797 103.755C621.663 104.131 621.768 104.702 621.915 104.764C622.796 105.135 622.318 106.235 623.038 106.677C623.379 106.887 623.103 107.202 622.906 107.372C621.862 108.277 621.594 109.533 621.317 110.79Z" fill="#B30000" />
                    <path d="M628.387 97.1607C627.775 97.2244 627.482 97.9133 626.853 97.9414C626.257 98.2703 625.66 97.9607 625.063 97.9436C624.392 97.922 623.999 97.4574 623.59 97.017C622.214 94.8858 622.219 94.6504 623.663 92.6772C624.958 91.5467 626.236 91.4214 627.82 92.2708L627.818 92.2706C629.006 93.3629 629.536 94.6499 628.993 96.2532C628.585 96.419 628.437 96.7568 628.387 97.1607Z" fill="#2D251E" />
                    <path d="M627.82 92.2695C626.388 91.9392 624.981 91.8551 623.662 92.6759C623.968 92.156 624.169 91.2937 624.86 91.441C625.851 91.6535 627.107 91.0676 627.82 92.2695Z" fill="#A00000" />
                    <path d="M619.543 96.5008C619.426 98.9854 619.204 101.458 618.808 103.915C618.636 103.714 618.629 103.477 618.673 103.237C619.185 100.449 619.037 97.5957 619.512 94.8047C619.897 95.3639 619.516 95.9356 619.543 96.5008Z" fill="#BB2928" />
                    <path d="M624.934 97.7159C625.574 97.791 626.214 97.8661 626.852 97.9411C626.492 98.7464 625.858 98.1355 625.359 98.232C625.204 98.2078 625.048 98.1845 624.893 98.1603C624.765 97.9985 624.783 97.8515 624.934 97.7159Z" fill="#81170D" />
                    <path d="M624.934 97.716C624.921 97.8636 624.907 98.012 624.893 98.1605C624.151 98.1305 623.693 97.7745 623.59 97.0169C624.038 97.2496 624.485 97.4832 624.934 97.716Z" fill="#A00000" />
                    <path d="M625.053 101.682C625.215 101.657 625.317 101.619 625.411 101.633C625.546 101.654 625.751 101.665 625.644 101.887C625.618 101.942 625.438 101.962 625.349 101.934C625.255 101.904 625.185 101.8 625.053 101.682Z" fill="#A00000" />
                    <path d="M625.103 144.643C623.503 144.638 621.901 144.643 620.369 144.073C620.312 144.025 620.245 143.999 620.17 143.996C619.823 143.76 619.459 143.561 619.036 143.5C618.767 143.346 618.557 143.113 618.289 142.957C618.079 142.794 617.887 142.611 617.702 142.421C617.259 141.916 616.871 141.38 616.68 140.724C616.599 140.328 616.453 139.952 616.313 139.575C615.593 137.61 616.423 135.972 617.414 134.37C617.638 134.114 617.892 133.886 618.118 133.631C618.193 133.55 618.276 133.479 618.364 133.412C618.676 133.197 618.975 132.963 619.264 132.715C619.353 132.643 619.448 132.583 619.547 132.526C620.537 131.986 621.621 131.741 622.709 131.497C623.539 131.484 624.359 131.566 625.154 131.815C625.651 132.051 626.114 132.358 626.641 132.538C626.748 132.605 626.826 132.698 626.877 132.815C627.864 133.708 628.885 134.539 629.464 135.82C630.233 137.524 629.733 139.173 629.476 140.847C629.159 141.074 629.129 141.486 628.883 141.759C628.582 141.987 628.355 142.265 628.273 142.645C627.144 143.194 626.293 144.187 625.103 144.643Z" fill="#2C251E" />
                    <path d="M622.184 123.006C622.33 123.02 622.474 123.035 622.619 123.05C623.669 122.927 624.421 123.33 624.844 124.312C625.631 126.513 624.861 127.706 623.375 128.465C622.45 128.964 621.564 128.531 620.667 128.357C618.659 126.653 618.581 125.071 620.421 123.414C620.957 123.057 621.6 123.159 622.184 123.006Z" fill="#2D251F" />
                    <path d="M620.536 128.052C621.482 128.189 622.428 128.327 623.375 128.465C623.959 128.541 624.555 128.563 625.12 128.705C625.798 128.875 626.18 130.056 625.73 130.78C626.909 130.537 627.31 131.901 628.439 131.882C628.808 131.876 628.501 132.445 628.26 132.579C627.846 132.809 627.36 132.861 626.877 132.812C626.807 132.815 626.74 132.801 626.679 132.769C626.301 132.371 625.715 132.417 625.292 132.117C624.349 132.003 623.408 131.888 622.466 131.773C622.582 131.211 622.514 130.632 622.574 130.063C622.628 129.549 622.06 129.079 621.393 129.179C620.377 129.33 620.379 128.762 620.536 128.052Z" fill="#A9060C" />
                    <path d="M624.844 124.313C624.161 123.79 623.421 123.365 622.619 123.05C623.028 122.259 624.164 121.481 623.209 120.566C622.336 119.731 622.032 118.613 621.309 117.74C620.996 117.361 620.937 116.969 621.061 116.521C621.242 116.428 621.39 116.442 621.479 116.649C621.912 118.745 623.271 120.174 624.942 121.343C625.259 121.565 625.594 121.771 625.9 122.016C626.065 122.264 626.451 122.263 626.548 122.588C625.875 123.329 626.514 123.917 626.778 124.548C626.134 124.469 625.488 124.391 624.844 124.313Z" fill="#A90608" />
                    <path d="M628.884 141.757C628.962 141.376 628.902 140.904 629.476 140.845C629.439 141.252 629.247 141.56 628.884 141.757Z" fill="#741B1E" />
                    <path d="M594.411 105.329C593.407 105.949 592.692 106.761 592.627 108.006C591.221 107.708 591.074 107.359 591.845 106.165C592.074 105.81 592.298 105.449 592.524 105.091C593.153 105.17 593.782 105.249 594.411 105.329Z" fill="#900000" />
                    <path d="M586.071 117.517C586.638 117.622 586.886 116.485 587.705 117.171C587.978 117.4 588.068 117.603 588.014 117.812C587.916 118.185 587.654 117.914 587.451 117.86C586.993 117.74 586.531 117.632 586.071 117.517Z" fill="#A20000" />
                    <path d="M587.751 111.693C587.427 112.229 587.215 112.58 586.994 112.946C586.613 112.089 586.627 112.058 587.751 111.693Z" fill="#A20000" />
                    <path d="M590.132 102.271C590.294 102.337 590.375 102.471 590.317 102.627C590.288 102.703 590.155 102.783 590.065 102.786C589.901 102.793 589.766 102.686 589.8 102.508C589.829 102.352 589.957 102.26 590.132 102.271Z" fill="#A20000" />
                    <path d="M638.118 134.27C637.049 134.238 636.652 134.717 637.022 135.647C637.143 135.951 636.995 136.196 636.829 136.242C636.334 136.38 636.084 135.734 636.034 135.587C635.808 134.936 636.13 134.234 636.621 133.858C637.109 133.483 637.831 133.37 638.12 134.268L638.118 134.27Z" fill="#A10000" />
                    <path d="M598.73 102.026C597.275 101.831 595.822 101.648 594.35 101.893C594.076 101.94 593.609 102.009 593.587 101.569C593.56 101.059 594.13 101.513 594.307 101.256C594.179 100.877 593.766 100.958 593.521 100.785C593.568 100.681 593.578 100.59 593.628 100.557C595.629 99.1989 597.62 99.1996 599.576 100.646C599.822 100.828 599.998 101.107 600.272 101.414C599.682 101.453 599.169 101.659 598.732 102.026L598.732 102.027L598.73 102.026Z" fill="#980000" />
                    <path d="M599.418 92.9017C599.395 93.4544 599.274 93.96 598.769 94.2856C598.825 93.8915 598.882 93.4975 598.938 93.1035C599.098 93.0355 599.258 92.9686 599.418 92.9017Z" fill="#55201B" />
                    <path d="M598.847 97.2151C599.501 97.3657 599.234 97.8423 599.209 98.2343C598.637 98.0541 598.839 97.6003 598.847 97.2151Z" fill="#4D211D" />
                    <path d="M627.366 90.2584C627.339 89.9605 626.874 89.7155 627.168 89.4108C627.404 89.1653 627.784 89.3155 628.071 89.4123C628.513 89.5616 628.936 89.7779 629.229 90.312C628.566 90.5577 627.965 90.2758 627.366 90.2584Z" fill="#AC0000" />
                    <path d="M635.37 103.157C634.434 102.606 633.381 102.458 632.337 102.28C632.849 102.108 633.367 101.785 633.874 101.8C634.666 101.822 635.293 102.24 635.37 103.157Z" fill="#920000" />
                    <path d="M635.284 96.3703C635.715 96.1903 636.13 95.7854 636.619 96.1687C636.793 96.3053 637.337 96.1148 637.113 96.5789C637.02 96.7734 636.83 97.2429 636.322 96.9136C636.004 96.7078 635.473 96.8678 635.284 96.3703Z" fill="#A00000" />
                    <path d="M635.141 101.192C634.892 101.099 634.536 101.422 634.386 101.082C634.236 100.74 634.637 100.652 634.825 100.484C635.004 100.324 635.255 100.172 635.444 100.42C635.736 100.8 635.049 100.855 635.141 101.192Z" fill="#920000" />
                    <path d="M633.195 100.622C633.617 100.711 633.879 100.902 633.777 101.393C633.364 101.257 633.266 100.944 633.195 100.622Z" fill="#920000" />
                    <path d="M635.141 101.192C635.481 101.229 635.939 100.965 636.062 101.554C635.736 101.482 635.35 101.563 635.141 101.192Z" fill="#920000" />
                    <path d="M617.934 142.294C618.173 142.356 618.305 142.523 618.378 142.749C618.517 143.024 618.964 143.059 618.934 143.464C618.949 143.516 618.963 143.568 618.978 143.62C618.314 144.368 618.439 144.59 619.817 145.213C618.529 144.999 617.727 146.97 616.231 145.832C616.081 145.717 615.931 145.738 615.84 145.91C615.752 146.076 615.818 146.225 615.963 146.319C616.259 146.513 616.568 146.685 616.865 146.879C617.205 147.101 617.12 147.41 616.837 147.507C616.569 147.598 616.067 147.406 616.156 147.87C616.247 148.344 616.743 148.066 617.072 148.078C617.136 148.08 617.199 148.149 617.312 148.217C616.843 148.796 616.159 148.732 615.71 148.486C614.525 147.834 613.834 148.397 613.228 149.276C612.771 149.186 613.162 148.619 612.658 148.531C612.436 148.939 612.257 149.378 612.637 149.784C612.959 150.13 613.368 150.395 613.869 150.467C614.138 150.506 614.502 150.545 614.462 150.904C614.425 151.239 614.035 151.535 613.787 151.477C612.516 151.176 611.242 151.704 609.984 151.398C610.303 149.699 610.374 149.641 611.662 150.019C611.718 150.066 611.76 150.126 611.809 150.18C611.885 150.264 611.808 150.399 611.911 150.469C611.937 150.486 612.003 150.467 612 150.443C611.983 150.3 611.806 150.268 611.77 150.128C611.6 149.507 610.625 149.492 610.695 148.693C610.989 147.052 611.836 146.238 613.118 146.353C613.172 146.386 613.214 146.44 613.236 146.507C613.335 146.406 613.124 146.405 613.173 146.31C613.29 145.642 613.312 144.933 614.137 144.683C614.523 144.567 614.106 144.555 614.09 144.526C613.794 143.982 614.114 143.881 614.542 143.917C615.051 143.959 615.559 143.773 616.067 143.926C615.32 143.566 614.503 143.625 613.712 143.525C613.432 143.49 613.128 143.456 613.108 143.085C613.088 142.739 613.296 142.572 613.628 142.588C614.054 142.609 614.176 142.414 614.148 142.009C614.115 141.527 614.306 141.128 614.817 141.026C615.321 140.925 615.542 141.223 615.58 141.699C615.584 141.757 615.603 142 615.694 141.852C616.557 140.445 616.898 142.17 617.526 142.157C617.635 142.151 617.754 142.357 617.934 142.294Z" fill="#B81B1B" />
                    <path d="M611.828 150.195C610.577 149.617 610.407 150.701 609.984 151.395C609.909 151.393 609.835 151.388 609.76 151.379C609.842 150.39 610.395 149.539 610.585 148.581C610.68 148.481 610.76 148.486 610.824 148.614C610.826 148.87 610.913 149.1 611.189 149.124C611.922 149.185 611.946 149.642 611.828 150.195Z" fill="#B81F1E" />
                    <path d="M619.856 148.11C620.276 147.865 620.582 147.851 620.85 148.102C620.92 148.167 620.858 148.374 620.858 148.516C620.517 148.492 620.212 148.393 619.856 148.11Z" fill="#AF0007" />
                    <path d="M619.044 143.342C619.501 143.42 619.952 143.507 620.17 143.996C619.714 144.057 619.388 143.706 618.978 143.62L618.977 143.622C618.874 143.499 618.896 143.406 619.044 143.342Z" fill="#90221E" />
                    <path d="M630.526 140.618C630.581 140.566 630.648 140.448 630.731 140.435C630.867 140.415 630.924 140.537 630.885 140.66C630.864 140.726 630.798 140.799 630.735 140.825C630.591 140.886 630.539 140.791 630.526 140.618Z" fill="#A10000" />
                    <path d="M609.289 125.183C609.049 124.576 608.744 124.009 608.278 123.541C608.352 122.638 609.168 122.743 609.382 123.089C609.831 123.814 610.383 123.509 610.92 123.539C610.998 123.543 611.08 123.515 611.149 123.475C611.873 123.051 611.822 124.25 612.378 124.078C613.323 123.787 613.6 124.358 613.749 125.084C613.888 125.759 614.649 125.85 614.916 126.392C614.221 129.72 613.44 133.034 612.856 136.381C612.21 140.086 610.98 143.642 610.243 147.321C610.099 148.038 609.964 148.792 609.515 149.42C609.403 149.243 609.408 149.078 609.569 148.93C609.632 148.456 609.696 147.981 609.76 147.506C610.045 145.92 610.356 144.333 609.919 142.722C610.045 142.376 610.045 142.376 610.274 142.202C609.907 142.404 609.907 142.404 609.996 142.897C610.084 143.165 610.119 143.432 610.029 143.707C609.907 144.079 609.67 144.319 609.264 144.324C608.853 144.329 608.762 143.994 608.679 143.695C608.534 143.171 608.506 142.59 607.938 142.294C607.679 142.144 607.491 141.934 607.398 141.648C607.042 140.973 606.501 141.041 605.919 141.28C605.825 141.339 605.726 141.385 605.624 141.425C605.347 141.525 605.084 141.445 604.795 141.316C604.734 141.226 604.73 141.575 604.781 141.424C604.804 141.36 604.819 141.39 604.886 141.452C605.272 141.809 605.2 142.231 605.041 142.644C604.933 142.924 604.646 143.186 604.447 142.829C604.043 142.107 603.569 142.638 603.133 142.656C602.933 142.522 602.982 142.679 602.99 142.798C602.297 143.27 600.161 143.18 599.691 142.613C599.006 141.788 599.916 141.68 600.363 141.324C599.945 141.275 599.482 140.763 599.416 141.711C599.389 142.083 598.752 141.989 598.531 141.697C598.149 141.192 597.622 141.303 597.135 141.213C597.024 141.167 596.926 141.103 596.837 141.023C596.411 140.038 596.411 140.038 597.24 140.008C596.531 139.828 595.852 139.535 595.124 139.441C594.421 139.349 594.247 138.879 594.374 138.331C594.517 137.721 594.942 137.324 595.622 137.653C596.061 137.865 596.56 137.841 596.98 138.081C599.903 138.52 602.766 138.284 605.241 136.598C608.241 134.556 609.902 131.662 609.861 127.931C609.69 127.489 609.714 127.024 609.702 126.565C609.799 126.035 609.749 125.548 609.289 125.183Z" fill="#BE2D2C" />
                    <path d="M602.906 142.501C603.585 142.074 604.281 141.499 604.685 142.847C605.138 141.962 604.793 141.569 603.766 141.446C604.593 140.971 605.196 141.296 605.762 141.214C605.944 141.609 605.61 141.878 605.518 142.205C605.335 142.863 605.468 143.416 606.147 143.653C606.754 143.865 607.224 143.569 607.514 143.021C607.696 142.679 607.69 142.244 608.022 141.973C608.502 142.22 609.039 142.373 608.917 143.144C608.87 143.444 608.784 144.059 609.318 144.072C609.834 144.084 609.771 143.525 609.838 143.152C609.866 142.997 609.879 142.84 609.901 142.683C610.852 143.113 610.539 143.847 610.416 144.592C610.253 145.579 610.276 146.6 609.759 147.506C609.789 147.268 609.828 147.031 609.846 146.792C609.865 146.526 609.978 146.145 609.592 146.111C609.103 146.066 609.352 146.464 609.331 146.706C609.274 147.37 609.132 147.904 608.344 147.236C607.912 146.871 607.26 147.489 606.773 146.829C606.619 146.621 606.074 146.444 605.878 146.064C605.544 145.414 605.003 145.542 604.442 145.588C604.104 145.615 604.083 145.821 604.005 146.044C603.897 146.354 604.056 146.465 604.317 146.561C604.951 146.793 605.575 147.051 606.204 147.292C606.425 147.376 606.737 147.437 606.636 147.736C606.528 148.053 606.29 147.973 606.092 147.754C605.416 147.008 605.436 148.094 605.238 148.122C604.14 146.131 602.435 147.043 600.953 147.097C601.01 146.669 601.543 147.015 601.58 146.649C601.595 146.502 601.583 146.333 601.522 146.201C601.463 146.071 601.35 146.127 601.243 146.209C600.615 146.685 599.864 146.252 599.155 146.496C598.547 146.707 597.916 145.546 598.137 144.771C598.569 143.259 597.861 142.442 596.362 142.721C596.207 142.75 595.964 142.835 595.904 142.768C595.323 142.115 594.436 142.39 593.764 142.031C593.627 141.958 593.442 141.943 593.45 141.738C593.46 141.492 593.661 141.382 593.854 141.375C594.535 141.351 595.24 141.211 595.968 141.923C595.776 140.85 595.644 140.088 594.519 140.606C593.606 141.026 593.862 140.004 593.892 139.929C594.24 139.055 593.738 138.597 593.131 138.169C592.911 138.013 592.552 137.906 592.739 137.554C592.896 137.26 593.166 137.583 593.372 137.549C593.722 137.491 594.061 137.366 594.404 137.271C594.666 137.092 594.899 137.194 595.128 137.341C595.778 137.506 596.426 137.678 596.98 138.081C596.513 137.993 596.029 137.956 595.584 137.801C595.201 137.668 594.986 137.773 594.771 138.062C594.565 138.338 594.469 138.609 594.646 138.943C594.88 139.387 595.143 138.901 595.316 138.964C596.033 139.231 596.721 139.578 597.647 139.997C596.405 139.99 596.792 140.522 597.05 141.012C596.714 141.38 597.082 141.513 597.26 141.71C597.155 141.489 596.838 141.339 597.05 141.012C597.641 141.07 598.456 140.424 598.715 141.562C598.75 141.716 599.069 141.82 599.231 141.645C599.58 141.266 598.811 141.121 599.017 140.713C599.737 140.847 600.455 140.982 601.22 141.124C600.984 141.598 600.53 141.601 600.221 141.815C600.045 141.937 599.676 141.825 599.688 142.163C599.699 142.501 600.031 142.691 600.278 142.616C601.151 142.352 602.086 143.623 602.906 142.501Z" fill="#BB2424" />
                    <path d="M609.567 148.931C609.549 149.094 609.532 149.257 609.514 149.42C609.366 149.967 609.548 150.605 609.06 151.057C609.028 150.551 609.024 150.042 608.958 149.542C608.889 149.033 609.15 148.92 609.567 148.931Z" fill="#BB2424" />
                    <path d="M591.191 133.96C591.783 134.36 592.188 134.908 592.469 135.558C591.871 135.163 591.291 134.754 591.191 133.96Z" fill="#B10C10" />
                    <path d="M596.478 143.404C595.937 143.864 595.689 143.748 595.422 143.42C595.77 143.143 596.026 143.344 596.478 143.404Z" fill="#BB2424" />
                    <path d="M595.127 137.341C594.886 137.318 594.644 137.295 594.403 137.271C594.349 137.097 594.294 136.922 594.24 136.747C594.624 136.812 594.975 136.928 595.127 137.341Z" fill="#78261F" />
                    <path d="M610.824 148.613C610.744 148.603 610.664 148.593 610.585 148.581C610.949 147.116 611.236 145.626 611.692 144.19C612.603 141.319 613.32 138.419 613.789 135.438C614.173 133.01 614.902 130.638 615.4 128.226C616.75 121.688 617.268 115.028 618.217 108.43C618.286 107.955 618.349 107.479 618.416 107.004C618.74 107.409 618.534 107.85 618.481 108.268C618.104 111.269 617.71 114.269 617.321 117.269C617.066 119.921 617.323 122.634 616.392 125.153C616.303 125.348 616.612 125.188 616.451 125.188C616.385 125.187 616.405 125.155 616.422 125.074C616.553 124.456 616.882 124.498 617.266 124.831C617.663 125.175 617.722 125.645 617.697 126.142C617.676 126.558 617.414 127.126 618.281 126.985C618.573 126.938 618.697 127.28 618.787 127.562C618.981 128.179 619.043 128.784 619.936 129.007C620.547 129.159 620.33 129.948 620.057 130.465C619.773 131.002 619.39 131.122 618.923 130.648C618.811 130.534 618.683 130.436 618.53 130.382C618.244 130.281 617.927 130.273 617.785 130.553C617.611 130.895 617.907 131.056 618.183 131.143C619.005 131.398 619.33 132.016 619.435 132.804L619.429 132.801C619.06 133.064 618.607 133.217 618.344 133.62L618.362 133.641C618.066 133.77 617.963 134.067 617.791 134.303C616.787 135.959 615.972 137.657 616.593 139.675C616.706 140.014 616.694 140.396 616.944 140.687C617.274 141.222 617.603 141.757 617.933 142.292C617.168 142.412 616.591 142.111 616.214 141.477C615.957 141.574 615.951 141.717 616.033 141.873C616.149 142.093 616.278 142.321 615.974 142.478C615.769 142.584 615.535 142.713 615.304 142.523C615.081 142.34 615.1 142.122 615.223 141.881C615.362 141.611 615.438 141.299 615.035 141.228C614.659 141.161 614.297 141.497 614.421 141.772C615.039 143.149 614.21 143.086 613.189 142.947C614.149 143.451 615.213 143.017 616.03 143.638C616.169 143.744 616.633 143.166 616.507 143.856C616.452 144.153 616.239 144.483 615.957 144.322C615.362 143.98 614.756 144.594 614.158 144.018C614.279 144.71 614.979 144.313 615.089 144.927C613.519 144.382 613.787 145.857 613.272 146.511C612.453 146.513 611.126 147.545 610.971 148.289C610.95 148.403 610.875 148.506 610.824 148.613Z" fill="#BB2928" />
                    <path d="M614.915 126.392C614.149 126.105 613.295 125.945 613.381 124.786C613.417 124.313 612.997 124.149 612.535 124.211C612.563 124.515 613.091 124.432 612.987 124.828C612.649 124.988 612.27 124.867 612.147 124.618C611.436 123.182 610.372 123.941 609.384 124.141C609.291 123.808 609.697 123.33 609.246 123.191C608.966 123.105 608.482 123.105 608.277 123.541C607.48 122.384 606.244 121.72 605.221 120.817C605.028 120.472 605.14 120.144 605.434 119.991C605.743 119.83 606.056 119.762 605.981 119.315C605.969 119.244 606.027 119.163 606.077 119.102C606.352 118.774 608.894 118.961 609.126 119.333C609.299 119.61 609.459 119.932 609.26 120.229C608.987 120.633 608.626 120.266 608.422 120.328C608.757 120.458 609.143 120.544 609.55 120.07C609.981 119.566 609.65 119.305 609.387 118.954C609.178 118.672 609.301 118.42 609.581 118.257C609.923 118.056 610.269 118.057 610.57 118.345C610.932 118.695 611.032 119.151 611.126 119.632C611.238 120.213 611.184 120.989 612.266 120.521C612.815 120.284 613.809 121.436 613.554 122.016C613.392 122.388 613.58 122.387 613.737 122.5C614.1 122.761 614.272 123.168 614.526 123.534C614.693 123.101 614.693 122.644 614.927 122.261C615.01 122.126 615.151 121.907 615.081 121.828C614.08 120.701 615.24 120.32 615.787 119.728C616.034 117.825 616.283 115.921 616.53 114.017C617.111 109.572 617.693 105.127 618.274 100.682C618.582 101.093 618.385 101.535 618.332 101.956C617.375 109.368 616.415 116.781 615.434 124.189C615.335 124.934 615.091 125.659 614.915 126.392Z" fill="#BB2625" />
                    <path d="M589.571 131.968C587.448 132.165 587.378 132.1 587.936 130.502C588.651 130.808 588.583 131.987 589.571 131.968Z" fill="#AC0004" />
                    <path d="M590.699 148.069C590.837 147.057 592.028 146.134 593.013 146.307C593.894 146.461 594.546 147.061 594.501 147.89C594.422 149.352 593.429 150.402 592.555 150.263C591.075 150.024 590.522 149.37 590.699 148.069Z" fill="#712018" />
                    <path d="M582.03 141.483C582.948 141.62 583.809 142.675 583.654 143.476C583.489 144.333 581.934 145.331 580.951 145.21C580.155 145.112 579.325 144.108 579.428 143.368C579.578 142.282 580.911 141.317 582.03 141.483Z" fill="#811D15" />
                    <path d="M630.897 122.663C631.056 122.691 631.214 122.718 631.373 122.746C631.019 124.077 630.693 124.201 629.61 123.398C629.189 123.086 628.72 123.063 628.241 123.149C627.838 123.221 627.503 123.255 627.516 122.694C628.644 122.828 629.773 123.043 630.897 122.663Z" fill="#990000" />
                    <path d="M626.549 122.588C626.214 122.531 625.991 122.349 625.901 122.016C626.506 122.084 627.119 122.137 627.515 122.698C627.193 122.661 626.871 122.625 626.549 122.588Z" fill="#990000" />
                    <path d="M621.479 116.649C621.339 116.606 621.201 116.564 621.061 116.521C621.094 116.211 621.128 115.902 621.161 115.594C621.801 115.784 621.531 116.249 621.479 116.649Z" fill="#4C241E" />
                    <path d="M626.336 105.612C626.392 105.312 626.585 105.189 626.877 105.192C627.009 105.082 627.148 105.086 627.292 105.167C627.318 105.211 627.344 105.254 627.37 105.297C627.158 105.843 626.72 105.638 626.336 105.612Z" fill="#611E1C" />
                    <path d="M627.421 104.809C627.742 104.853 628.062 104.896 628.381 104.941C628.194 105.488 627.738 105.272 627.368 105.297L627.335 105.232C627.229 105.063 627.273 104.926 627.421 104.809Z" fill="#691E19" />
                    <path d="M627.421 104.809C627.393 104.95 627.364 105.091 627.335 105.232C627.182 105.218 627.029 105.206 626.875 105.193C627.037 104.826 626.225 104.488 626.76 104.205C627.155 103.994 627.272 104.516 627.421 104.809Z" fill="#990000" />
                    <path d="M611.269 113.259C610.17 113.64 609.139 113.775 608.499 112.493C608.213 111.969 608.414 111.515 608.705 111.074C608.881 110.94 609.057 110.807 609.234 110.673C609.909 110.385 610.538 110.427 611.1 110.941C611.066 111.286 611.436 111.398 611.524 111.673C611.7 112.102 611.72 112.51 611.368 112.869C611.335 112.998 611.302 113.129 611.269 113.259Z" fill="#33251E" />
                    <path d="M611.1 110.941C610.477 110.852 609.855 110.762 609.233 110.673C609.959 110.033 610.622 110.127 611.1 110.941Z" fill="#991618" />
                    <path d="M608.705 111.074C608.637 111.547 608.567 112.02 608.499 112.493C608.343 112.469 608.187 112.446 608.031 112.421C608.085 111.886 608.165 111.365 608.705 111.074Z" fill="#8E181C" />
                    <path d="M611.368 112.868C611.42 112.47 611.472 112.071 611.524 111.672C611.966 112.135 612.222 112.575 611.368 112.868Z" fill="#8F181A" />
                    <path d="M602.255 109.402C602.548 109.417 602.562 109.596 602.533 109.733C602.506 109.86 602.41 110.049 602.315 110.069C602.099 110.114 602.092 109.9 602.11 109.759C602.126 109.629 602.21 109.507 602.255 109.402Z" fill="#AC0004" />
                    <path d="M615.787 119.729C615.692 120.279 615.852 121.073 614.614 120.546C615.012 121.247 616.044 121.516 615.316 122.296C614.818 122.83 615.068 123.6 614.676 124.145C614.469 124.432 614.137 124.253 614.163 124.03C614.286 122.95 613.396 122.678 612.759 122.19C612.95 121.912 613.734 122.106 613.417 121.65C613.187 121.318 612.759 120.932 612.406 120.73C611.963 120.477 612.111 121.341 611.631 121.538C611.363 120.777 610.56 120.323 610.747 119.275C610.821 118.862 610.441 117.893 609.421 118.684C609.902 118.974 610.629 119.298 610.251 119.868C609.657 120.762 608.722 120.79 607.766 120.289C607.947 120.055 608.173 120.234 608.368 120.222C608.626 120.205 608.985 120.408 609.085 120.039C609.134 119.857 608.932 119.609 608.843 119.392C608.692 119.02 608.389 119.054 608.159 119.229C607.516 119.717 606.941 119.523 606.172 118.95C606.701 120.183 605.343 120.082 605.22 120.818C603.307 120.103 601.369 119.536 599.289 119.755C599.031 119.648 598.61 119.884 598.541 119.38C598.487 118.988 598.577 118.691 598.927 118.463C599.254 118.249 599.485 118.102 599.5 118.687C599.509 119.059 599.795 119.149 600.098 119.07C600.449 118.977 600.446 118.685 600.378 118.393C600.181 117.541 600.45 116.457 599.11 116.184C599.596 115.779 600.022 115.94 600.35 116.053C601.473 116.443 602.476 116.56 603.674 116.036C604.168 115.819 605.357 115.887 605.969 116.742C606.66 117.708 607.906 117.587 608.865 118.044C609.15 118.18 609.496 117.764 609.347 117.427C609.034 116.722 609.2 116.418 609.953 116.259C610.695 116.102 611.49 115.68 611.877 116.7C612.215 117.594 612.63 118.21 613.719 118.114C614.146 118.076 613.949 118.646 614.188 118.85C614.36 118.997 614.53 119.049 614.716 118.895C614.907 118.738 614.899 118.592 614.714 118.409C614.411 118.109 614.138 117.778 613.789 117.39C614.771 117.232 614.969 118.2 615.601 118.446C615.731 118.496 615.686 118.835 615.492 119.058C615.171 119.425 615.205 119.455 615.787 119.729Z" fill="#B81D1C" />
                    <path d="M609.289 125.183C609.62 125.351 609.951 125.519 610.32 125.706C610.111 125.938 609.75 126.07 609.832 126.46C609.739 126.562 609.66 126.551 609.595 126.43C609.533 126.004 609.191 125.647 609.289 125.183Z" fill="#BB2625" />
                    <path d="M609.594 126.43L609.713 126.446L609.831 126.46C609.841 126.95 610.062 127.437 609.859 127.93C609.334 127.507 609.534 126.957 609.594 126.43Z" fill="#782729" />
                    <path d="M597.324 120.225C597.529 119.633 597.973 119.854 598.37 119.917C598.147 120.447 597.717 120.275 597.324 120.225Z" fill="#792323" />
                    <path d="M619.436 132.806C618.781 132.432 618.737 131.321 617.657 131.392C617.457 131.405 616.977 130.89 617.178 130.435C617.378 129.983 617.86 129.925 618.306 129.9C618.901 129.866 619.192 130.277 619.422 130.777C619.814 130.493 619.929 130.117 620.032 129.745C620.098 129.503 619.917 129.084 619.839 129.13C618.795 129.749 619.099 128.393 618.543 128.266C618.115 128.168 618.428 127.899 618.505 127.644C618.619 127.263 618.396 127.031 617.959 127.21C617.253 127.5 617.24 127.503 617.308 126.698C617.365 126.008 617.646 125.264 616.773 124.852C616.277 125.236 616.804 125.641 616.785 126.076C616.241 125.679 616.228 125.678 616.304 125.085C616.638 122.48 616.981 119.875 617.319 117.271C617.742 118.207 617.157 119.168 617.386 120.15C617.459 120.467 617.322 120.569 617.726 120.667C618.626 120.886 619.284 121.413 619.411 122.419C619.83 122.245 620.219 122.081 620.623 121.913C620.816 122.201 620.474 122.671 620.955 122.827C621.008 123.009 620.902 123.094 620.766 123.15C620.682 123.139 620.62 123.142 620.594 123.157C620.654 123.189 620.704 123.243 620.743 123.325C620.749 123.425 620.713 123.498 620.637 123.552C618.995 125.269 618.987 125.636 620.534 128.055C620.755 128.525 620.808 128.978 621.66 128.807C622.314 128.677 622.944 129.308 622.758 130.22C622.736 130.33 622.65 130.514 622.682 130.536C623.533 131.119 622.703 131.395 622.464 131.776C621.456 132.117 620.446 132.461 619.436 132.806Z" fill="#B61E1C" />
                    <path d="M620.639 123.549C620.64 123.455 620.641 123.361 620.642 123.266C620.569 123.2 620.551 123.143 620.588 123.096C620.623 123.05 620.655 123.029 620.684 123.032C620.774 122.963 620.865 122.893 620.957 122.824C621.366 122.884 621.775 122.945 622.185 123.006C621.72 123.331 621.169 123.411 620.639 123.549Z" fill="#A90608" />
                    <path d="M621.719 121.642C621.79 121.618 621.901 121.539 621.983 121.562C622.061 121.586 622.11 121.713 622.172 121.795C622.079 121.841 621.984 121.922 621.889 121.923C621.764 121.927 621.679 121.836 621.719 121.642Z" fill="#A90608" />
                    <path d="M618.344 133.622C618.41 132.957 618.763 132.671 619.43 132.803C619.206 133.259 618.833 133.516 618.344 133.622Z" fill="#B61E1C" />
                    <path d="M625.292 132.116C625.823 132.188 626.441 132.074 626.679 132.768C626.134 132.726 625.632 132.593 625.292 132.116Z" fill="#861A1B" />
                    <path d="M619.044 143.342C619.022 143.435 619 143.528 618.978 143.621C618.777 143.331 618.577 143.04 618.378 142.749C618.661 142.878 619.008 142.936 619.044 143.342Z" fill="#B41113" />
                    <path d="M616.945 140.69C616.541 140.452 616.485 140.092 616.594 139.677C616.854 139.965 616.983 140.298 616.945 140.69Z" fill="#722723" />
                    <path d="M617.792 134.306C617.802 133.93 617.844 133.581 618.362 133.643C618.323 133.993 618.084 134.172 617.792 134.306Z" fill="#90322B" />
                    <path d="M618.017 144.467C617.767 145.139 617.461 145.515 616.559 145.48C617.092 145.043 617.278 144.513 618.017 144.467Z" fill="#B41113" />
                    <path d="M611.828 150.195C612.079 150.263 612.376 150.178 612.6 150.46C612.279 150.903 611.806 150.556 611.45 150.774C611.368 150.357 611.754 150.402 611.828 150.195Z" fill="#B41113" />
                    <path d="M613.275 146.512C613.566 146.426 613.875 146.263 614.076 146.65C614.156 146.804 614.11 146.979 613.935 147.012C613.554 147.082 613.39 146.818 613.275 146.512Z" fill="#BB2928" />
                    <path d="M617.099 143.805C617.164 143.657 617.271 143.541 617.438 143.581C617.607 143.622 617.678 143.78 617.62 143.934C617.591 144.01 617.455 144.088 617.366 144.089C617.202 144.093 617.09 143.993 617.099 143.805Z" fill="#BB2928" />
                    <path d="M608.022 141.974C607.948 142.583 608.129 143.289 607.512 143.711C606.798 144.2 606.047 144.346 605.403 143.584C604.833 142.909 604.922 142.231 605.485 141.586C605.586 141.47 605.67 141.338 605.761 141.214L605.763 141.214C606.441 140.853 607.042 141.041 607.607 141.476C607.626 141.743 607.768 141.904 608.022 141.974Z" fill="#35261F" />
                    <path d="M607.608 141.477C606.993 141.389 606.378 141.302 605.764 141.215C606.415 140.577 607.067 140.67 607.608 141.477Z" fill="#35261F" />
                    <path d="M610.976 142.398C610.731 142.732 610.493 142.339 610.246 142.387C610.027 142.429 609.886 142.888 609.6 142.525C609.438 142.321 609.623 142.163 609.729 142.009C609.954 141.683 610.197 141.867 610.442 141.988C610.646 142.089 610.903 142.117 610.976 142.398Z" fill="#BB2424" />
                    <path d="M609.46 124.581C609.698 124.495 609.835 124.417 609.977 124.405C610.046 124.4 610.196 124.529 610.188 124.579C610.157 124.783 609.975 124.771 609.824 124.748C609.732 124.734 609.647 124.67 609.46 124.581Z" fill="#BB2625" />
                    <path d="M602.905 142.5C602.677 142.438 602.46 142.358 602.523 142.055C602.534 142.005 602.634 141.924 602.665 141.935C602.942 142.034 602.9 142.279 602.905 142.5Z" fill="#BB2424" />
                    <path d="M597.049 141.013C597.133 141.237 597.234 141.441 597.507 141.488C597.73 141.526 598.179 141.274 598.086 141.756C597.986 142.268 597.508 142.065 597.217 141.952C596.867 141.816 596.465 141.571 596.464 141.164C596.461 140.88 596.833 141.02 597.049 141.013Z" fill="#BE2D2C" />
                    <path d="M607.529 145.619C607.832 145.628 608.169 145.466 608.094 145.881C608.033 146.223 607.906 146.581 607.392 146.358C607.187 146.27 606.824 146.512 606.89 145.985C606.961 145.416 607.304 145.582 607.529 145.619Z" fill="#B81F1E" />
                    <path d="M592.578 149.144C591.923 149.097 591.332 148.804 591.499 148.186C591.591 147.842 591.767 147.031 592.591 147.209C593.321 147.367 593.676 147.785 593.643 148.528C593.608 149.329 593.064 149.224 592.578 149.144Z" fill="#8D1916" />
                    <path d="M580.323 143.185C580.33 142.374 580.783 141.978 581.458 142.185C582.044 142.365 582.975 142.339 582.85 143.425C582.745 144.338 581.963 144.648 581.367 144.573C580.846 144.506 579.912 144.159 580.323 143.185Z" fill="#961514" />
                    <path d="M609.85 116.954C610.05 116.949 610.177 116.91 610.243 116.956C610.306 117.002 610.308 117.135 610.336 117.231C610.263 117.241 610.17 117.286 610.121 117.255C610.038 117.203 609.982 117.106 609.85 116.954Z" fill="#B50C0E" />
                    <path d="M620.684 123.032C620.673 123.111 620.66 123.189 620.643 123.266C620.37 123.177 619.996 123.318 619.843 122.916C620.179 122.62 620.398 123.07 620.684 123.032Z" fill="#B30000" />
                  </g>
                </g>

                <defs>
                  <clipPath id="clip0_2001_351">
                    <rect
                      width="2806"
                      height="1100"
                      fill="white"
                      transform="matrix(0 -1 1 0 0 2806)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
          </div>
        </section>
      </div>
    </div>
  );
}
